{
 "system-security-plan": {
  "uuid": "2fa78e07-74ef-4cd6-8124-bc0050c0c4df",
  "metadata": {
   "title": "2 Twelve E3 Lab IaaS",
   "published": "2020-07-01T00:00:00.00-04:00",
   "last-modified": "2020-07-01T00:00:00.00-04:00",
   "version": "0.0",
   "oscal-version": "1.0-Milestone3",
   "new-control-stuff": [
    {
     "uuid": "1db1c1d6-ec40-4e58-8450-9de1f3b45ad1",
     "control-id": "ac-1",
     "by-component": [
      {
       "key": "2f9b561d-8ec2-4c5e-a5e0-2a348bdbbb9f",
       "value": {
        "uuid": "5926a452-8595-4ea9-a9fb-f1d036026ee6",
        "component-name": "Architecture Review Board",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\r\n\r\nThe ARB reviews and updates all E3LabIaas Information Security Policy at least every 3 years.  The CloudOps reviews and updates the E3LabIaas Procedures every year during the annual system review."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "f50c01bd-580d-4b4b-9ebc-86404fe776f2",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\r\n\r\nThe ARB reviews and updates all E3LabIaas Information Security Policy at least every 3 years.  The CloudOps reviews and updates the E3LabIaas Procedures every year during the annual system review.\r\n\r\nPart b2"
       }
      }
     ]
    },
    {
     "uuid": "6ffc7d94-0a5f-4d72-a72e-a34517766265",
     "control-id": "ac-2",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "91ce1708-55ad-4fbe-a7bf-840df4367141",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\r\n\r\nService Provider Responsibility:\r\n\r\n2 Twelve Solutions: 2 Twelve has identified two account types for the environment, one for each role – CloudOps team and Infrastructure team members. CloudOps team has administrative access to the environment.\r\n\r\nApplication: Application accesses are specific to each customer. CloudOps admins do not have access to customer application. After the creation of a customer admin account during the customer onboard process, administrators do not access the system unless requested. Admins can only access the OS layer of those instances.\r\n\r\nFor the authentication process, the first step requires the user’s private SSH key to authenticate against the public SSH key on the host.\r\n\r\nOperating System: Authorized administrators access operating systems by authenticating through the SSH. CloudOps team are considered as privileged users. All users must have a valid SSH key. Users must have a matching public SSH key on the operational system to establish connection with that host. Connections are enforced through IDPS and firewalls."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "8cb9dbb6-4168-4ba4-8a73-4c0738651703",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Solutions Responsibility:\n\nCloudOps team are privileged users in the environment. Requesting managers submit access requests as Change Requests.  When the ARB approves a request, system administrators will perform user account setup.\n\nApplication:  CloudOps team are designated as account managers for infrastructure tools (shared services). The customer is responsible for the account management actions for their Application instances. All infrastructure remote access is provided through SSH connections to the host.\n\nOperating System:  CloudOps team are considered as privileged users in the environment. The requesting manager initiate the account request/change process. CloudOps personnel will proceed with the normal access approval process through the ARB. The SSH configuration enforces the user to public-private key authentication. This entails that each user has a unique set of SSH Keys where the public key is added to the SSH host through Ansible. When a user attempts to login, user must present his or her private key installed on the workstation. Once connected to the system, all changes are handled by executing the prepared Ansible playbooks from the change management process against the scope of the change."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "24cfba8e-74b0-4c74-99b9-a8cbfab4b3f3",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve has established two groups for system accounts – CloudOps team and InfraOps team. Users who require administrative privileges within the instances are designated as CloudOps team. Users who require administrative privileged at the infrastructure layer are designated as the InfraOps team.\n\nApplication, Operating System:  User permissions are granted on the principle of least privilege and role based access needs, as depicted in the E3LabIaas Access and Identity Management Plan. Ticketing system is used to document and enforce the defined workflow for all account changes. The conditions for group and role membership are dictated by the function of the individual’s role to ensure those accounts only perform the functions commensurate with business needs.\n\nCustomer Responsibility:\n\nCustomers are responsible for establishing roles and groups within the application and the requirements for membership in such roles and groups."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "52a63303-a7df-4638-aa45-4c9603a4e696",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve has established two groups for system accounts – CloudOps team and InfraOps team. Users who require administrative privileges within the instances are designated as CloudOps team. Users who require administrative privileged at the infrastructure layer are designated as the InfraOps team.\n\nApplication:  Application accesses are specific to each customer. CloudOps members do not have access to customer application. After the creation of a customer admin account during the customer onboard process, administrators have no access to the customer application. Admins can only access the OS layer of those instances.\n\nFor the authentication process, the first step requires the user’s private SSH key to authenticate against the public SSH key on the host.\n\nOperating System:  CloudOps team are considered as privileged users in the environment. The requesting manager initiate the account request/change process. CloudOps personnel will proceed with the normal access approval process through the ARB. The SSH configuration enforces the user to public-private key authentication. This entails that each user has a unique set of SSH Keys where the public key is added to the SSH host through Ansible. When a user attempts to login, user must present his or her private key installed on the workstation. Once connected to the system, all changes are handled by executing the prepared Ansible playbooks from the change management process against the scope of the change.\n\nCustomer Responsibility:\n\nCustomers are responsible for establishing roles and groups within the application and the requirements for membership in such roles and groups."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "05feedf5-416a-472c-991c-63976907cca3",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe SO must approve requests to create information system accounts. Approval are documented and tracked through service tickets. Configuration management process is being followed through issue tracking and documented in E3LabIaas Access and Identity Management Plan.\n\nApplication:  The SO must approve requests to create accounts on shared services. Approval are documented and tracked through service tickets. Configuration management process is being followed through issue tracking and documented in E3LabIaas Access and Identity Management Plan.\n\nOperating System:  The SO must approve requests to create information system accounts. This includes access to the infrastructure. Approval are documented and tracked through service tickets.\n\nCustomer Responsibility:\n\nCustomers are responsible for designating approvers for application accounts."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "84156b4b-6556-4e21-92db-b972f78613ce",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nApplication, Operating System:  Accounts are created, enabled, modified, disabled, and removed following E3LabIaas Access and Identity Management Plan. Once the ticket is approved by the ISSO and SO, the CloudOps team will create the account(s), modify access rights, or disable accounts.\n\nCustomer Responsibility:\n\nCustomers are responsible for creating, enabling, modifying, disabling, and removing application accounts according to their respective account management procedures."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "5d00eb3c-b089-4d54-88c2-f292f9cea76d",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve monitors the use of system accounts through the use of audit logs. Activities on the host, are monitored and logged via Logging server. 2 Twelve monitors activity for privilege user accounts and account activity. Audit logs are forwarded to Logging server for review.\n\nThe following processes are in place to support account activity monitoring.\n\n• All account activity is logged by the logging facilities defined in the response to AU-2, and events are automatically sent to a SIEM tool\n\n• The CloudOps team monitors (using a SIEM tool) for system-wide account activity for application, and operating system.\n\n• Account creation, modification, and deletion events generate an alert in the SIEM tool for investigation.\n\n• Account additions, modifications, or deletions require a ticket before execution.\n\n• If any abnormal account activity is identified, the CloudOps Team is immediately notified through email.\n\n• After triage by the CloudOps Team, activities are tracked using a ticketing system.\n\nReference AU-2 for additional details on audit events generated in the environment.\n\nApplication:  2 Twelve monitors the use of system accounts through the use of audit logs. Activities on the host, are monitored and logged via Logging server. 2 Twelve monitors activity for privilege user accounts and account activity. Audit logs are forwarded to Logging server for review.\n\nOperating System:  2 Twelve monitors the use of system accounts through instance itself. Logs from IDPS, firewalls, audit, and system events are fed into Logging server. Pre-configured thresholds and search events are set up in Logging server and will generate alert if certain threshold is exceeded. CloudOps team will receive an alert via email or ticketing system.\n\nCustomer Responsibility:\n\nCustomers are responsible for the review of their user actions. Application logs are available through the platform to privileged customer users."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "a98022f7-d66d-41bd-8ebb-9a1b8454f74d",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nCloudOps team is notified through ticketing system when a user account requires modification or disablement due to change in role (change in privileges) or termination. 2 Twelve’s Human Resources is responsible to notify CloudOps team of the terminated employee in order to revoke access to the environment. CloudOps is responsible for revoking terminated personnel’s user’s SSH keys.\n\nApplication, Operating System:  2 Twelve utilizes the ticketing system to manage the entire lifecycle of accounts.  Changes to the accounts are initiated by customer. When the change is approved, the CloudOps team are notified via email when accounts are no longer needed due to termination, transfer or system usage change. When users are terminated, a notification is sent to HR and the respective manager. When users are promoted or transferred to another group, user role and access rights are automatically reviewed by the new manager and any permission not required in the new role is revoked. The user’s permissions are changed after proper approvals and authorization from the respective group owners is received. The ticketing system retains the tickets associated with changes to accounts and includes approvals for the changes. Personnel termination process described in PS-3.\n\nCustomer Responsibility:\n\nCustomers are responsible for notifying their account managers when accounts are no longer required, when users are terminated or transferred, or when system usage or need-to-know changes."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "5a65d4b9-53f4-415a-bfff-bf8436d1151e",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "2 Twelve Responsibility:\n\nUsers are authorized by role; specifically, users are assigned either to the CloudOps team group or the InfraOps Team group. CloudOps team is responsible for administrative activities on the instances. InfraOps Team is responsible for infrastructure level resources.\n\nApplication, Operating System:  Users are authorized access to the environment based on valid access authorization or intended usage. Authorization of access assignments, valid access authorization, and intended system usage are initiated by each manager who ensures that:\n\n• Access being requested is appropriate to the individual’s role and validates that the employee has completed the appropriate technical and security training for the access type being requested.\n\n• Tickets are created in the ticketing system relating to each request\n\n• All access (including permissions, membership to roles and groups, etc.) is required to follow the ‘need to know’ and ‘least privilege’ principles\n\n• User permissions are granted on the principle of least privilege and role based access needs, as depicted in the E3LabIaas Access and Identity Management Plan.\n\nCustomer Responsibility:\n\nCustomers are responsible for authorizing user access to the application based on their intended system usage."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "023937f0-8cfd-4eb0-8829-9afcdf35ad08",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe ARB review all user accounts annually to ensure compliance with account management requirements.\n\nApplication, Operating System:  User accounts are reviewed for compliance by the SO and CloudOps at least annually. Account permissions and privileges are being reviewed at least quarterly by CloudOps as described in CM-5(5). Only accounts with valid access authorizations for the environment are permitted. Any accounts determined to be unnecessary due to prior termination or transfer are removed or disabled in accordance with account management policies and procedures.\n\nCustomer Responsibility:\n\nCustomers are responsible for reviewing user access to the application."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "4f1f6817-126d-41f8-abc7-0df61e885d63",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nShared/group credentials are tightly controlled in the environment; all users authenticate to systems using unique SSH keys.\n\nApplication, Operating System:  Shared/group credentials are tightly controlled in the environment. Default root accounts are considered emergency account.\n\nCustomer Responsibility:\n\nCustomers are responsible for issuing and reissuing shared/group account credentials when individuals are removed from security groups for the application."
       }
      }
     ]
    },
    {
     "uuid": "bc268695-897b-4126-8a80-c57b27c3278d",
     "control-id": "ac-2.1",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "1942296a-eef9-47f5-900a-d2c8c1dcd4a7",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve employs tickets to track account management activities. Privileged user accounts within the environment is deployed using Ansible scripts. Logging server is leveraged to monitor user accounts within the environment.\n\nApplication, Operating System:  2 Twelve uses automated mechanisms to support the management of accounts for the application.  Tickets are used for the tracking and approval of information system account creation. Account creations for the infrastructure are completed through Ansible playbooks. Account activities are monitored through Logging server. Management of infrastructure accounts is tracked and documented through ticketing system. The ticketing system provides automated workflow for managing the following aspects of account management:\n\n• Requests for accounts.\n\n• Approvals for account creation, modification, and removal − Permission changes.\n\n• Notifications to account owners and manager for various account management tasks.\n\nCustomer Responsibility:\n\nThe Customer is responsible for employing automated mechanisms to support the management of application accounts including:\n\n• Permission changes\n\n• Requests for accounts.\n\n• Provisioning endpoints and new users.\n\n• Approvals for account creation, modification, and removal"
       }
      }
     ]
    },
    {
     "uuid": "937650bb-e97e-4cd4-8c47-2ebdc0d47201",
     "control-id": "ac-2.2",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "654817e3-ca76-47cd-931a-54a3d330437d",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "2 Twelve Responsibility:\n\n2 Twelve does not regularly use temporary or emergency accounts. If deployed, 2 Twelve disables all temporary and emergency accounts within 30 days.\n\nApplication, Operating System:  2 Twelve does not regularly use temporary or emergency accounts for the applications. If deployed, 2 Twelve disables all temporary and emergency accounts within 30 days. All accounts must go through the processes defined in AC-2.\n\nCustomer Responsibility:\n\nCustomers are responsible for reviewing user access to their applications."
       }
      }
     ]
    },
    {
     "uuid": "1d90223d-1e31-43cd-a4c0-96dca0ed23c7",
     "control-id": "ac-2.3",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "a49bc122-76ff-48dc-a96d-4927eb31bca0",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "2 Twelve Responsibility:\n\nApplication:  Account inactivity on Qualys SaaS is enforced through password expiration, Qualys passwords are configured to expire after 60 days. Logging server and Security scanner access requires authentication through the bastion host. Bastion host and hosts password are configured to expire after 60 days.\n\nDatabase:  admins do not have direct access to customer applications nor the data in the database. Database is accessed through application where customer makes request to application and application request goes to database.\n\nOperating System:  Account inactivity is enforced through password expiration. Bastion host and hosts password are configured to expire after 60 days.\n\nCustomer Responsibility:\n\nCustomers are responsible for monitoring the usage of user accounts and disabling after a period of inactivity."
       }
      }
     ]
    },
    {
     "uuid": "6a082b1f-f54b-4e8b-a8d3-05e04e261737",
     "control-id": "ac-2.4",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "dd8f054c-0828-48f6-96bc-46a58460240b",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nApplication, Operating System:  For the applications, all account management activities, such as creation, modification, enabling, disabling and/or removing accounts are logged and forwarded to logging server for review.  All account changes such as request; approval, creation, modification, and deletion of access to resources in the environment are tracked, documented, and retained in ticketing system. The CloudOps team is notified via email of all account management activities.\n\nCustomer Responsibility:\n\nThe Customer is responsible for automatically auditing account creation, modification, enabling, disabling, and removal actions, and notify organization personnel."
       }
      }
     ]
    },
    {
     "uuid": "c7e946e7-81c5-40f7-859b-c9423cabf510",
     "control-id": "ac-3",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "b48071f9-f7bb-4149-a1b0-716a6279c23e",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nUser permissions are granted on the principle of least privilege and role based access needs, as depicted in the E3LabIaas Access and Identity Management Plan. Ticketing system is used to document and enforce the defined workflow for all account changes. Approved users will be added to Ansible playbook and granted access into the environment. The host is the used to enforce privilege access. Users must provide a valid SSH key to the host.\n\nApplication: Application accesses are specific to each customer. Network ACLs are leveraged to enforce access flow and provide logical separation such that customers only have access to their own environment. Application front end users must authenticate through MFA or SAML 2.0 token. Reverse proxies enforces TLS1.2 encryption to protect the communication session. Administrators do not have access to client applications. Access to Logging server, Security scanner is limited to authorized personnel based on role based access on the principle of least privilege.\n\nOperating System: Authorized administrators access operating systems by authenticating through the host. All users must have a valid SSH key. Users must have a matching public SSH key on the instance to establish connection with that host. Connections are enforced through network ACLs. Creation, modification, and deletion of users and groups must go through the defined CM process and requested through ticketing system for ARB approval.\n\nCustomer Responsibility:\n\nThe Customer is responsible for enforcing approved authorizations for logical access to application and system resources in accordance with applicable access control policies."
       }
      }
     ]
    },
    {
     "uuid": "2076815a-33d1-4b8e-9cf6-b9ecc37130e1",
     "control-id": "ac-4",
     "by-component": [
      {
       "key": "1d67acc8-a361-4cd6-8321-61e0070ba3bf",
       "value": {
        "uuid": "3fa640d2-7910-49a3-806a-3ab108d9a2c6",
        "component-name": "Operating System",
        "description": "Information flow for the operating system is enforced network ACLs. Firewalls are configured to deny by default and only allow by exception."
       }
      },
      {
       "key": "82d3ffdd-d64d-4e32-bd21-2da165fc9033",
       "value": {
        "uuid": "fa93c519-5179-4352-9a4b-d0bccc44dd69",
        "component-name": "2 Twelve Responsibility",
        "description": "Information flow is enforced policy enforcement points and network ACLs, which define the allowed traffic flows throughout the environment and across the boundary. Firewalls are configured to deny-by-default and only allow by exception."
       }
      }
     ]
    },
    {
     "uuid": "f85df37b-e98e-46c9-a47d-dc5ecd7a88b9",
     "control-id": "ac-5",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "8eeb2d15-bd35-436a-8303-58fa7378f6b7",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve separates host level administrator activities conducted by the CloudOps team from the infrastructure activities conducted by the InfraOps team. CloudOps team is provided privileges to launch Ansible scripts to configure the environment, while the InfraOps team has privilege access to the configure the underlying compute, storage, network infrastructure. CloudOps team has administrative access to Logging server and security scanning. Please refer to AC-2(b) for more information on account management and the approval and use of security groups in the role-based access schemes. Separation of Duties is further defined through 2 Twelve Separation of Duties Matrix.\n\nApplication:  2 Twelve separates administrator activities conducted by the CloudOps team from the infrastructure activities conducted by the InfraOps team. CloudOps team is provided privileges to launch Ansible scripts to configure the environment, while the InfraOps team has privilege access to the configure the underlying compute, storage, network infrastructure.\n\nOperating System: 2 Twelve separates administrator activities conducted by the CloudOps team from the infrastructure activities conducted by the InfraOps team. CloudOps team is provided privileges to launch Ansible scripts to configure the environment, while the InfraOps team has privilege access to the configure the underlying compute, storage, network infrastructure.\n\nCustomer Responsibility:\n\nThe Customer is responsible for developing and maintaining a separation of duties for privileged and non-privileged users."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "551552e0-df07-4143-b411-71a44854bcc4",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve separates host level administrator activities conducted by the CloudOps team from the infrastructure activities conducted by the InfraOps team. CloudOps team is provided privileges to launch Ansible scripts to configure the environment, while the InfraOps team has privilege access to the configure the underlying compute, storage, network infrastructure. CloudOps team has administrative access to Logging server and security scanning. Please refer to AC-2(b) for more information on account management and the approval and use of security groups in the role-based access schemes. Separation of Duties is further defined through 2 Twelve Separation of Duties Matrix.\n\nApplication:  2 Twelve separates administrator activities conducted by the CloudOps team from the infrastructure activities conducted by the InfraOps team. CloudOps team is provided privileges to launch Ansible scripts to configure the environment, while the InfraOps team has privilege access to the configure the underlying compute, storage, network infrastructure.\n\nOperating System: 2 Twelve separates administrator activities conducted by the CloudOps team from the infrastructure activities conducted by the InfraOps team. CloudOps team is provided privileges to launch Ansible scripts to configure the environment, while the InfraOps team has privilege access to the configure the underlying compute, storage, network infrastructure.\n\nCustomer Responsibility:\n\nThe Customer is responsible for developing and maintaining a separation of duties for privileged and non-privileged users."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "c2faf994-6e92-4be9-8f48-20eb796f0e45",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve separates host level administrator activities conducted by the CloudOps team from the infrastructure activities conducted by the InfraOps team. CloudOps team is provided privileges to launch Ansible scripts to configure the environment, while the InfraOps team has privilege access to the configure the underlying compute, storage, network infrastructure. CloudOps team has administrative access to Logging server and security scanning. Please refer to AC-2(b) for more information on account management and the approval and use of security groups in the role-based access schemes. Separation of Duties is further defined through 2 Twelve Separation of Duties Matrix.\n\nApplication:  2 Twelve separates administrator activities conducted by the CloudOps team from the infrastructure activities conducted by the InfraOps team. CloudOps team is provided privileges to launch Ansible scripts to configure the environment, while the InfraOps team has privilege access to the configure the underlying compute, storage, network infrastructure.\n\nOperating System: 2 Twelve separates administrator activities conducted by the CloudOps team from the infrastructure activities conducted by the InfraOps team. CloudOps team is provided privileges to launch Ansible scripts to configure the environment, while the InfraOps team has privilege access to the configure the underlying compute, storage, network infrastructure.\n\nCustomer Responsibility:\n\nThe Customer is responsible for developing and maintaining a separation of duties for privileged and non-privileged users."
       }
      }
     ]
    },
    {
     "uuid": "f69c969a-ec2b-47c2-914b-515f6ce078ae",
     "control-id": "ac-6",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "4cb25f5a-c4ac-4d86-ab72-dff7f3b78b1e",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nPrivileged users are assigned roles and privileges only sufficient to complete their assigned responsibilities. CloudOps team is assigned access to the host with privileges to launch Ansible scripts for the configuration and maintenance of the environment. CloudOps team are assigned full access to logging server and security scanner.\n\nApplication, Operating System:  Privileged users are assigned roles and privileges only sufficient to complete their assigned responsibilities. CloudOps team is assigned access to the host with privileges to launch Ansible scripts for the configuration and maintenance of the environment. CloudOps team are assigned full access to logging server and security scanner. E3LabIaas employs both the ‘need to know’ and ‘least privilege’ principles, only allowing employee access to information systems necessary to accomplish assigned tasks, in accordance with organizational missions and business functions and explicitly authorizing access to specific information and information systems. Account activity is monitored through Logging Server. All activities associated with granting, modifying and revoking privileged access to accounts and resources within the environment must:\n\n• Have the request(s) tied to a ticket in the approved ticketing and tracking system\n\n• Have appropriate, documented approval from the data or resource owner\n\n• Follow approved change management procedures\n\nPlease refer to related controls AC-2, AC-3, and CM-7 for additional information.\n\nCustomer Responsibility:\n\nThe customer is responsible for employing the principle of least privilege for all access to the application."
       }
      }
     ]
    },
    {
     "uuid": "73965ecf-2fcb-4c92-aacf-a4480fa7d0f0",
     "control-id": "ac-6.1",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "7702b1ec-10b5-4287-bacf-32e69f72b9a7",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve explicitly authorizes access to CloudOps team for the purpose of deploying Ansible scripts to configure and maintain the environment. 2 Twelve also authorizes access to the infrastructure console for specific individuals. The CloudOps team has administrative access to security scanner and has administrative access to logging server.\n\nApplication, Operating System:  All access to systems in the environment is deny by default and must be explicitly authorized following the principle of “need to know” and “least privilege”. Authorization includes access to security related functions such as establishing system accounts and configuring access authorizations (permissions, privileges).\n\nCustomer Responsibility:\n\nThe Customer is responsible for explicitly authorizing access to the application and defined security functions."
       }
      }
     ]
    },
    {
     "uuid": "be192ea0-c581-4178-8a07-8a87c6dd9b34",
     "control-id": "ac-6.2",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "448eed58-79c7-4148-befa-daa2ec4b2811",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nPrivileged users only access the environment to conduct system security functions and use their sole accounts for this access.\n\nApplication, Operating System:  Only privileged users, such as members of the CloudOps and InfraOps teams have access to the tool accounts (Logging server, Security scanner) for the purpose of performing administrative or security control implementation functions. Infrastructure access is restricted to CloudOps team, InfraOps team. Separation of Duties matrix defines privileged and non-privileged access for users performing specific function. At this time, both CloudOps and InfraOps accounts are considered as privileged accounts.\n\nCustomer Responsibility:\n\nThe Customer is responsible for requiring users of information system accounts, or roles, with access to the application security functions, use non-privileged accounts or roles, when accessing non-security functions."
       }
      }
     ]
    },
    {
     "uuid": "915e9fac-3de5-4d58-b3d8-2e10b582c93c",
     "control-id": "ac-6.5",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "5d26ae8c-54bd-45a4-844b-5973a3e46990",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nOnly CloudOps team and InfraOps team members are provided privileged accounts in the environment.\n\nApplication, Operating System:  Privileged accounts are restricted to members of the CloudOps and InfraOps team. CloudOps team is provided administrative privileges for the environment. Through the “least privilege” and “need to know” principles, 2 Twelve restricts access to privileged accounts to a very limited number of personnel with approved roles and responsibilities. Individuals with the following roles and responsibilities are given access to privileged accounts:\n\n• System Owner, 2 Twelve Leadership\n\n• Services Manager, 2 Twelve Leadership\n\n• Information System Security Officer\n\n• Operations Manager, CloudOps Team\n\n• Infrastructure Operations Manager, InfraOps Team\n\nNote: All access that is not specifically granted to a user is denied by default.\n\nCustomer Responsibility:\n\nThe customer is responsible for restricting privileged accounts on the information system to defined roles for the application."
       }
      }
     ]
    },
    {
     "uuid": "c3100412-f6ae-4c9d-b1b7-5aaa7e25eef0",
     "control-id": "ac-6.9",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "95f1b3ac-9f6f-4a6d-9034-7b10f1453386",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nPrivileged functions are captured and forwarded to logging server for review and monitoring by the CloudOps team.\n\nApplication:  All privileged functions from the application are captured by logging sidecars and forwarded to logging server for review by the CloudOps team. Customers can request a report of privilege function logs on a as needed basis. When pre-defined events or triggers are detected, appropriate team are notified of the event through alerts. The information systems produce audit records that contain sufficient information to, at a minimum, establish what type of event occurred, when (date and time) the event occurred, where the event occurred, the source and destination addresses, user/process identifiers, event descriptions, success/fail indications, filenames involved, and access control or flow control rules invoked.\n\nOperating system: All privileged actions such as sudo and yum update are captured and forwarded to logging server for near real time monitoring and alerting. Actions from hosts and all other instances are configured to feed all activities to logging server. When pre-defined events or triggers are detected, appropriate team are notified of the event through alerts. The information systems produce audit records that contain sufficient information to, at a minimum, establish what type of event occurred, when (date and time) the event occurred, where the event occurred, the source and destination addresses, user/process identifiers, event descriptions, success/fail indications, filenames involved, and access control or flow control rules invoked.\n\nCustomer Responsibility:\n\nThe Customer is responsible for ensuring the information system audits the execution of privileged functions."
       }
      }
     ]
    },
    {
     "uuid": "1796bfc4-b569-416f-a193-f0113cb74b02",
     "control-id": "ac-6.10",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "a11b2650-df1a-4e36-b2f5-c49cb788191a",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nNon-privileged users in the application are controlled by role-based assignments to prevent execution of privileged functions. No non-privileged users have any other access to the environment.\n\nApplication, Operating system:  Non-privileged users in the environment are controlled by role-based assignments to prevent execution of privileged functions. No non-privileged users have any other access to the environment. Separation of Duties matrix defines privileged and non-privileged access for users performing specific function. Policies apply a deny by default and least privilege enforcements to ensure non-privileged users cannot access privilege security functions.\n\nCustomer Responsibility:\n\nThe Customer is responsible for ensuring the application prevents non-privileged users from executing privileged functions."
       }
      }
     ]
    },
    {
     "uuid": "fb966b13-5562-4879-9676-db9434b99f1c",
     "control-id": "ac-7",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "7e6d6404-bb65-4a13-bb37-8c15b03e26eb",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nApplication: For security scanner, account lockouts are set to maximum of 3 tries, after the third unsuccessful attempt, the user account is locked until unlocked by an administrator. For logging server, account lockouts are set to maximum of 3 tries, after the third unsuccessful attempt, the user account is locked until unlocked by an administrator\n\nOperating System: 2 Twelve personnel use SSH cryptographic keys to access hosts and locks out after three (3) failed login attempts are implemented on all environment instances. Once the threshold is met, the source IP will be blocked for five minutes.  The only way to regain access is to wait for five minutes and try to access again after the source IP has been unblocked.\n\nCustomer Responsibility:\n\nThe customer is responsible for enforcing a limit of consecutive invalid login attempts within a designated period according to the customer defined policy value."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "7053a958-b6c3-4583-9ad6-0e5c151dfd34",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nApplication: For security scanner, account lockouts are set to maximum of 3 tries, after the third unsuccessful attempt, the user account is locked until unlocked by an administrator. For logging server, account lockouts are set to maximum of 3 tries, after the third unsuccessful attempt, the user account is locked until unlocked by an administrator. Automatic locking is implemented by the application based on configured policies.\n\nOperating System: 2 Twelve personnel use SSH cryptographic keys to access hosts and locks out after three (3) failed login attempts are implemented on all environment instances. Once the threshold is met, the source IP will be blocked for five minutes.  The only way to regain access is to wait for five minutes and try to access again after the source IP has been unblocked. Automatic locking is implemented by IDPS called Fail2Ban which scans access logs for invalid logon attempts and automatically applies blocks by apply drop packet rules at the host firewalls.\n\nCustomer Responsibility:\n\nThe customer is responsible for enforcing a limit of consecutive invalid login attempts within a designated period according to the customer defined policy value."
       }
      }
     ]
    },
    {
     "uuid": "6a26ff20-3638-49ff-9d25-8e2761e3fb2c",
     "control-id": "ac-8",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "80b8c2c9-7a25-46e0-90eb-e6081bb46940",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe system warning banner is displayed prior to access to the host. The banner informs users that the usage may be monitored and subject to audit, unauthorized use is prohibited, and use of the system is considered consent to such monitoring.\n\nApplication, Database, Operating System: The system warning banner is displayed prior to access to the shared services, and instances. The application banner is configured in accordance with requirements from the 2 Twelve customers. The banner informs users that the usage may be monitored and subject to audit, unauthorized use is prohibited, and use of the system is considered consent to such monitoring.\n\nUsers are presented with the following warning message and much acknowledge prior to accessing environment:\n\n“Authorized uses only. All activity may be monitored and reported.”\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure that there is a notification or warning banner before granting access to the system that provides privacy and security notices consistent with FedRAMP requirements and federal laws, Executive Orders, directives, policies, regulations, standards, and guidance."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "56adeb72-3cf3-4f11-9c0d-43e5aab19ff1",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe system warning banner is displayed prior to access to the host. The banner informs users that the usage may be monitored and subject to audit, unauthorized use is prohibited, and use of the system is considered consent to such monitoring.\n\nApplication, Database, Operating System: The system warning banner is displayed prior to access to the shared services, and instances. The application banner is configured in accordance with requirements from the 2 Twelve customers. The banner informs users that the usage may be monitored and subject to audit, unauthorized use is prohibited, and use of the system is considered consent to such monitoring.\n\nUsers are presented with the following warning message and much acknowledge prior to accessing environment:\n\n“Authorized uses only. All activity may be monitored and reported.”\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure retains the notification message or banner on the screen until users acknowledge the usage conditions and take explicit actions."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "498b0879-238f-4e3f-ba9e-b973b6bce3d6",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe environment is intended for private consumption. This requirement is not applicable to the system.\n\nApplication, Database, Operating System:  The environment is for private consumption by a designated 2 Twelve customer. This requirement is not applicable.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure that for all publicly accessible systems there is a notification or warning banner before granting access to the system that provides privacy and security notices consistent with FedRAMP requirements and federal laws, Executive Orders, directives, policies, regulations, standards, and guidance.\n\nAdditional FedRAMP Requirements and Guidance\n\nRequirement 1: The service provider shall determine elements of the cloud environment that require the System Use Notification control.  The elements of the cloud environment that require System Use Notification are approved and accepted by the JAB/AO.\n\nRequirement 2: The service provider shall determine how System Use Notification is going to be verified and provide appropriate periodicity of the check.  The System Use Notification verification and periodicity are approved and accepted by the JAB/AO.  If performed as part of a Configuration Baseline check, then the % of items requiring setting that are checked and that pass (or fail) check can be provided.\n\nRequirement 3: If not performed as part of a Configuration Baseline check, then there must be documented agreement on how to provide results of verification and the necessary periodicity of the verification by the service provider.  The documented agreement on how to provide verification of the results are approved and accepted by the JAB/AO.\n\nAC-8 Req.\n\nControl Summary Information\n\nResponsible Role: CloudOps; InfraOps; 2 Twelve Leadership\n\nImplementation Status (check all that apply):\n\n☒ Implemented\n\n☐ Partially implemented\n\n☐ Planned\n\n☐ Alternative implementation\n\n☐ Not applicable\n\nControl Origination (check all that apply):\n\n☐ Service Provider Corporate\n\n☐ Service Provider System Specific\n\n☐ Service Provider Hybrid (Corporate and System Specific)\n\n☐ Configured by Customer (Customer System Specific)\n\n☐ Provided by Customer (Customer System Specific)\n\n☒ Shared (Service Provider and Customer Responsibility)\n\n☐ Inherited from pre-existing FedRAMP Authorization for Click here to enter text. , Date of Authorization\n\nAC-8 What is the solution and how is it implemented?\n\nReq. 1\n\nThis control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nAs all privileged users must access the environment through SSH, the system warning banner is applied at the host during SSH session initiation.\n\nApplication, Database, Operating System:  As all privileged users must access the environment through SSH, the system warning banner is applied at the host during SSH session initiation. The system use notifications contain explicit action language that must be taken to accept the notification before continuing to access systems.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to determine elements of the cloud environment that require the System Use Notification control.\n\nReq. 2\n\nThis control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe warning banner is defined as part of the configuration, which is deployed through ansible. Any deviation from the ansible settings will be re-applied at each deployment. In addition, the banner display and content is check manually by the CloudOps during each infrastructure access.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to determine how System Use Notification is going to be verified and provide appropriate periodicity of the check.\n\nReq. 3\n\nThis control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe warning banner is defined as part of the configuration, which is deployed through ansible. Any deviation from the ansible settings will be re-applied at each deployment. In addition, the banner display and content is check manually by the CloudOps during each infrastructure access.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure users are presented with a warning banner prior to accessing application."
       }
      }
     ]
    },
    {
     "uuid": "0ff5ce99-1ae1-4789-9468-9f84d84470bb",
     "control-id": "ac-11",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "a436f2f8-ac26-470e-acfb-33cf29dc94c4",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe host disconnects the user SSH session automatically after 5 minutes, or upon request from the user. Timeout settings for all hosts within the boundary are configured through Ansible to 300 seconds. After 300 seconds of inactivity, the user is disconnected from the resources.\n\nApplication, Operating System:\n\nFor all infrastructure access, the host disconnects the user SSH session automatically after 5 minutes, or upon request from the user. This is enforced by “ClientAliveInterval 300” and “Client AliveCountMax 0” configured on each host within the boundary including the bastion host.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure the application further access to the system by initiating a session lock after 15 minutes."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "c67a2747-3b56-4cd3-973f-feaec8d184cd",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe host requires the user to initiate a new session and authenticate to establish a new user session. The application requires the user to re-authenticate to resume the user session after the lock.\n\nApplication, Operating System:\n\nThe host requires the user to initiate a new session and authenticate to establish a new user session.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure the application retains the session lock until the user reestablishes access to the information system."
       }
      }
     ]
    },
    {
     "uuid": "36137fcb-0a78-4fce-a4c7-57fa49c7c99a",
     "control-id": "ac-11.1",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "a335b162-f9bd-4574-9b0b-23b7b88ec7ce",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe environment enforces a session lock after five minutes of inactivity for all account access.  When the session lock occurs, the login page will replace the previous displayed information. User must reestablish access using proper identification and authentication procedures.\n\nApplication, Operating System:  The envirnoment enforces a session lock after five minutes of inactivity for all account access.  When the session lock occurs, the login page will replace the previous displayed information. User must reestablish access using proper identification and authentication procedures. Timeout settings for all hosts within the boundary are configured through Ansible to 300 seconds. After 300 seconds of inactivity, the user is disconnected.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure the application conceals, via the session lock, information previously visible on the display."
       }
      }
     ]
    },
    {
     "uuid": "9d6e1be0-ba36-41b6-9839-9cfc2212d5be",
     "control-id": "ac-12",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "02c97882-8a79-4acd-845e-a5af94369194",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe host disconnects the user SSH session automatically after 5 minutes, or upon request from the user. Timeout settings for all hosts within the boundary are configured through Ansible to 300 seconds. After 300 seconds of inactivity, the user is disconnected.\n\nApplication, Operating System:  For all infrastructure access, the bastion host disconnects the user SSH session automatically after 5 minutes, or upon request from the user. This is enforced by “ClientAliveInterval 300” and “Client AliveCountMax 0” configured on each host within the boundary.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure the application automatically terminates a user session after at least 15 minutes of inactivity."
       }
      }
     ]
    },
    {
     "uuid": "a8493c9d-24f6-4c11-a1cf-56d1d253a797",
     "control-id": "ac-14",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "0334e638-332e-4e56-bfa8-65b6409638e9",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nAll actions in the environment require user authentication. Users are required to authenticate to host via SSH. Users are required to authenticate with Logging server and security scanner again prior to conducting any activities in those application.\n\nApplication, Operating System:  All actions in the environment require user authentication. Users are required to authenticate prior to conducting any activities in the system backend. Users are required to authenticate with logging server and security scanner again prior to conducting any activities in those application. No action is allowed prior to authentication to the host.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure actions are identified that can be performed within the application without identification or authentication."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "9b42c837-d3eb-4414-8bee-0ecad08440e6",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nNo actions are allowed in the environment without authentication. The requirements for identification and authentication are documented within this SSP. For further details of the identification and authentication requirements, review IA-2 for user identification and IA-3 for device authentication.\n\nApplication, Database, Operating System:  No actions are allowed in the environment without authentication. The requirements for identification and authentication to the application, and operating system are documented within this SSP. Customer applications authentication requires MFA or SSO through SAML 2.0. All E3LabIaas access to 2 Twelve admins to perform administrative activities is provided through SSH connections to the host.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure that all actions that can be performed without identification or authentication are fully documented."
       }
      }
     ]
    },
    {
     "uuid": "26e5e743-2f93-42d1-a314-320ca1d3a3c7",
     "control-id": "ac-17",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "2c9dc2d8-b61f-4114-8e43-aff250039262",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nPrivileged users are required to remotely access through SSH connection to the host from 2 Twelve-issued laptops. The requirements and implementation guidance for remote access is documented throughout this SSP and within access management policies and procedures and Access and Identity Management plan. Requests and authorizations for access to the environment are managed through the following:\n\n• Ticketing system: a ticket must be submitted by the user or accounts manager.\n\n• Approval: the ticket must have the appropriate level of management approval if any of the noted activities are needed.\n\n• Change control: any activities must follow an approved change management process. Authorized individuals may connect to the environment only after they have successfully authenticated to the host using valid SSH keys. There are no other access paths permitted into the infrastructure.\n\nApplication, Operating System:  All access to the environment and associated resources is restricted to only those assigned and approved administrators that require access. Tools and network access is limited to InfraOps and CloudOps team. It is the responsibility of the customer to define the usage restrictions for any partner or provisioning user accounts in their environment. Customer applications can only be accessed through MFA or SSO through SAML 2.0. Please see AC-2 for more information on application account types and permissions.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to establish and document usage restrictions, configuration/connection requirements, and implementation guidance for each type of remote access permitted for the application."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "ffab3329-24f4-4c5e-a0c1-e5183211e314",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve authorizes remote connections to the environment through the use of Service ticket system and system design documentation that identifies the ports and protocols in use for all communication across the system boundary.\n\nApplication, Database, and Operating System:  Approval to the infrastructure is requested and approved through the established workflow within Service. The requirements for identification and authentication to the application, database and operating system are documented within this SSP. privileged users are required to remotely access through SSH connection to the bastion host from a 2 Twelve-defined range of IP addresses using 2 Twelve-issued laptops. Customer applications accessed must through the front portal via MFA or SSO through SAML 2.0. All E3LabIaaS access to 2 Twelve admins to perform administrative activities is provided through SSH connections to the bastion host.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to authorize remote access to the information system prior to allowing any remote access connections."
       }
      }
     ]
    },
    {
     "uuid": "7f7c5b3b-8fab-4aed-bc04-c0e495aca2dc",
     "control-id": "ac-17.1",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "48fd6652-cf20-45e3-a3a4-fb7353eca9c8",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nRemote sessions with proper authentication and identification are the only approved methods for gaining remote administrative access to the environment. The system onitors the use of remote access methods through audit logging and review. Remote sessions to hosts are logged on the host and forwarded to Splunk for near real time monitoring. For more detailed implementation of the monitoring in place, refer to AU-2 and AU-3 of this SSP.\n\nApplication: Auditable events are logged and sent to the logging server in real time. 2 Twelve auditable events are selected using a risk-based approach that takes into account their information security standards. The following are deemed to be auditable events:\n\n• All administrator privileged functions\n\n• Authentication checks\n\n• Authorization checks\n\n• Data deletions, data access, data changes, and permission changes\n\nOperating System: Events captured in OSSEC, ClamAV and rkhunter are forwarded to Logging server. 2 Twelve monitors industry-wide security threats and has defined the following events as auditable events that should be captured in system audit logs based on mission/business needs:\n\n• Failed logon attempts\n\n• File integrity monitoring\n\n• Account and/or profile changes and deletions\n\n• Changes to system security settings and parameters\n\n• System shutdowns/restarts\n\n• Use of privileged accounts and/or activities\n\nCustomer Responsibility:\n\nIt is the customer responsibility to monitor and control remote access methods."
       }
      }
     ]
    },
    {
     "uuid": "90f6ce57-e60f-4fd2-8774-d9f6de9d8fc6",
     "control-id": "ac-17.2",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "9ee57b00-a7c7-426a-807b-1f5781eec000",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve routes all remote access through one ingress gateway. Network ACLs restrict connections both internally between components and externally with outside networks.\n\nApplication: For log server and security scanner access, web access is funneled through reverse proxies implementing FIPS approved cryptographic algorithms. By default, web access only accepts TLS 1.2 and Digicert is leveraged as the root certificate for HTTPs connections\n\nOperating System:  Authorized 2 Twelve administrators access operating systems by authenticating through SSH.  All users must have a valid SSH key. 2 Twelve utilizes SSH key pairs generated using ECC 384 bit size key.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to implement cryptographic mechanisms to protect the confidentiality and integrity of remote access sessions for the application."
       }
      }
     ]
    },
    {
     "uuid": "9f8d03a6-aeef-41c7-96aa-16fa83a1fa19",
     "control-id": "ac-17.3",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "e4270880-7ae8-48f4-b6e8-00ed4c2a3056",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve routes all remote access through one ingress gateway. Network ACLs restrict connections both internally between components and externally with outside networks.\n\nApplication: For log server and security scanner access, web access is funneled through reverse proxies implementing FIPS approved cryptographic algorithms. By default, web access only accepts TLS 1.2 and Digicert is leveraged as the root certificate for HTTPs connections\n\nOperating System:  2 Twelve routes all remote access through one ingress gateway. Network ACLs restrict connections both internally between components and externally with outside networks.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to route all remote accesses through a managed controlled access point."
       }
      }
     ]
    },
    {
     "uuid": "7247d3e2-44a4-4a8b-a312-3811f034bf45",
     "control-id": "ac-17.4",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "8b914fb7-88d2-4807-be63-a1aa60a2e8e3",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nAll access to the information system is remote access. As such all privileged command usage and access to security-relevant information must be performed via remote access.\n\nApplication, Database and Operating System:  All infrastructure access to the information system is remote access. As such all privileged command usage and access to security-relevant information must be performed via remote access. All remote access to the system is conducted via SSH for administrative access. Before personnel can connect to environment, they must first be approved for remote access by an authorized manager following the configuration management process and submit request through ticketing system.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to authorize the execution of privileged commands and access to security-relevant information via remote access only for administrative functions only."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "6e3b1e9b-e2c3-4e5a-b6c9-2ccb24779765",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe only way to perform privileged command usage and access to security-relevant information on  is via remote access since it is a cloud based environment. The security roles and access rights are documented within this SSP, separation of duty matrix, and the access control policies and procedures.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to document the rationale for such access in the security plan of the application."
       }
      }
     ]
    },
    {
     "uuid": "d835cd72-0e3f-48ce-8f68-8ea0646d6f71",
     "control-id": "ac-18",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "2acfb8c7-3221-442c-bc11-f70d4f6c7eaf",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nAll access to the information system is remote access. There is no wireless access within the authorization boundary.\n\nCustomer Responsibility:\n\nThere is no wireless access within the authorization boundary."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "6e5dead4-aae9-4f03-ab44-10b1299e9716",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nAll access to the information system is remote access. There is no wireless access within the authorization boundary.\n\nCustomer Responsibility:\n\nThere is no wireless access within the authorization boundary."
       }
      }
     ]
    },
    {
     "uuid": "f07f125e-1648-46ee-a74c-2f101dd14fb8",
     "control-id": "ac-18.1",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "65d6bde5-1df2-4ffa-8880-25b707be3f19",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nAll access to the information system is remote access. There is no wireless access within the authorization boundary.\n\nCustomer Responsibility:\n\nThere is no wireless access within the authorization boundary."
       }
      }
     ]
    },
    {
     "uuid": "2f6bc5bd-d06c-47eb-a1a7-9f3461d5feb1",
     "control-id": "ac-19.5",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "e17ffdc0-31a1-4e37-ba4c-7d90c661925c",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe usage of mobile devices is prohibited in infrastructure. Only 2 Twelve-issued laptops may access the host, no other mobile devices are allowed access to the environment. It should be noted that 2 Twelve laptops, similar to a customer’s workstation, is not part of the authorized boundary. 2 Twelve does not have any physical assets within its authorized boundary.\n\nCustomer Responsibility:\n\nThere are no mobile devices within the authorization boundary."
       }
      }
     ]
    },
    {
     "uuid": "b5c90add-ef02-49f8-a689-025e566e7019",
     "control-id": "ac-20",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "bec7e0a5-12e9-4522-ba61-5bbb3019fbd7",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe ARB authorizes connections from to other information systems through the use of Interconnection Security Agreements which documents, for each interconnection, the interface characteristics, security requirements, and the nature of the information communicated such as:\n\n• Authorized Connections Information System Name\n\n• Name of Organization 2 Twelve System Connects To\n\n• Role and Name of Person Who Signed Connection Agreement\n\n• Name and Date of Interconnection Agreement\n\n• SP IP Address and Interface\n\n• Connection Security (IPSec VPN, SSL, Certificates, Secure File Transfer etc.)\n\n• Data Direction (incoming, outgoing, or both)\n\n• Information Being Transmitted\n\n• Ports or Circuit #\n\n2 Twelve E3LabIaas Information Security Policy require that the ARB:\n\n• Reviews and updates Interconnection Security Agreements at least annually and on input from FedRAMP; and\n\n• that prohibits the direct connection of defined unclassified, non-national security system to an external network without the use of boundary protections which meet Trusted Internet Connection (TIC) requirements documented within TIC 2.0 Reference Architecture document; https://www.fedramp.gov/files/2015/04/TIC_Ref_Arch_v2-0_2013.pdf.\n\n• employs deny-all, permit by exception policy for allowing to connect to external information systems\n\nApplication, Database, Operating System: The ARB authorizes connections from to other information systems through the use of Interconnection Security Agreements which documents, for each interconnection, the interface characteristics, security requirements, and the nature of the information communicated. 2 Twelve has currently has no ISA or an agreement in place with any external entities.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to establishes terms and conditions, consistent with any trust relationships established with other organizations with access to the Application."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "206dec55-aa4d-4ac1-b913-e059ab82f4f0",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe ARB authorizes connections from to other information systems through the use of Interconnection Security Agreements which documents, for each interconnection, the interface characteristics, security requirements, and the nature of the information communicated such as:\n\n• Authorized Connections Information System Name\n\n• Name of Organization 2 Twelve System Connects To\n\n• Role and Name of Person Who Signed Connection Agreement\n\n• Name and Date of Interconnection Agreement\n\n• SP IP Address and Interface\n\n• Connection Security (IPSec VPN, SSL, Certificates, Secure File Transfer etc.)\n\n• Data Direction (incoming, outgoing, or both)\n\n• Information Being Transmitted\n\n• Ports or Circuit #\n\n2 Twelve E3LabIaas Information Security Policy require that the ARB:\n\n• Reviews and updates Interconnection Security Agreements at least annually and on input from FedRAMP; and\n\n• that prohibits the direct connection of defined unclassified, non-national security system to an external network without the use of boundary protections which meet Trusted Internet Connection (TIC) requirements documented within TIC 2.0 Reference Architecture document; https://www.fedramp.gov/files/2015/04/TIC_Ref_Arch_v2-0_2013.pdf.\n\n• employs deny-all, permit by exception policy for allowing to connect to external information systems\n\nApplication, Database, Operating System: The ARB authorizes connections from to other information systems through the use of Interconnection Security Agreements which documents, for each interconnection, the interface characteristics, security requirements, and the nature of the information communicated. 2 Twelve has currently has no ISA or an agreement in place with any external entities.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to establishes terms and conditions, consistent with any trust relationships established with other organizations with access to the Application."
       }
      }
     ]
    },
    {
     "uuid": "641a7bd5-6ce7-47a7-9f2c-0f3836ce4b01",
     "control-id": "ac-20.1",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "4062563f-9343-4154-8718-2dc8f021246c",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe environment establishes terms and conditions with other organizations in partnership. During the planning phase of the interconnection, 2 Twelve along with the intended connecting party examine all relevant technical, security and administrative issues prior to formalizing an agreement. 2 Twelve and the intended connecting firm will develop and establish a connection plan for implementing or configuring appropriate security controls once 2 Twelve has had a chance to review the connecting actor’s security posture.\n\nApplication, Database, Operating System:  The environment establishes terms and conditions with other organizations in partnership. During the planning phase of the interconnection, 2 Twelve along with the intended connecting party examine all relevant technical, security and administrative issues prior to formalizing an agreement. All connections must be approved by the ARB prior to establishing connections.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to permit authorized individuals to use an external information system to access the information system or to process, store, or transmit data or information for the Application and verifies the implementation of required security controls with the external service provider."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "f2b7286f-0931-4f3f-af66-31c3df6f5d07",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nOnce the connection is established relies upon and maintains interconnections through security agreements to enforce approved authorizations for controlling the flow of information within the system and between interconnected systems.\n\nFor a list of approved interconnections, see Section 11, System Interconnections and CA-3 for more information.\n\nApplication, Database, Operating System:  Once the connection is established relies upon and maintains interconnections through security agreements to enforce approved authorizations for controlling the flow of information within the system and between interconnected systems. All external connections are protected through encryption, enforced through network ACLs and firewall policies, monitored through logging server, and reviewed at least annually as part of internal review.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to permit authorized individuals to use an external information system to access the information system or to process, store, or transmit data or information for the Application and retains approved information system connection or processing agreements."
       }
      }
     ]
    },
    {
     "uuid": "d718d5fc-dd7e-403b-ab23-ad5b7e052225",
     "control-id": "ac-20.2",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "b79b5aab-18f3-4652-957d-a96dd8f77d14",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nprohibits the usage of portable storage devices by any authorized individual on external information systems.\n\nThe approved Interconnection Security Agreements (ISA’s) for all interconnections with external systems prohibit where possible, and restricts where required the use of organization controlled portable storage devices. If not prohibited, the restrictions on the use of organization controlled portable storage devices will be specified in the ISA\n\nCustomer Responsibility:\n\nIt is the customer responsibility to restrict or prohibit the use of organization-controlled portable storage devices connected to the application or external information systems."
       }
      }
     ]
    },
    {
     "uuid": "e470c3e1-a2fe-4caa-8a9c-13cf341a0596",
     "control-id": "ac-21",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "f71e2262-5ed7-4840-add9-0da2bfbf8511",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "2 Twelve Responsibility:\n\n2 Twelve does not have a sharing partner and does not share any data with external parties. customers are responsible for restricting and facilitate data sharing with their partners.\n\nApplication, Database, Operating System:  Customers must contact 2 Twelve support for additional assistance with data sharing. Unless requested by the customer and approved by ARB/Legal, 2 Twelve does not share any data within the environment.\n\nCustomer Responsibility:\n\nCustomers are responsible for tagging their data to ensure appropriate information sharing. The agency is responsible for enabling authorized users to determine whether access authorizations assigned to the sharing partner match the access restrictions on the information being shared."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "6ebfc36d-6ce7-4f99-92be-b0520e775a0d",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "2 Twelve Responsibility:\n\n2 Twelve does not have a sharing partner and does not share any data with external parties. customers are responsible for restricting and facilitate data sharing with their partners.\n\nApplication, Database, Operating System:  Customers must contact 2 Twelve support for additional assistance with data sharing. Unless requested by the customer and approved by ARB/Legal, 2 Twelve does not share any data within the environment.\n\nCustomer Responsibility:\n\nCustomers are responsible for tagging their data to ensure appropriate information sharing. The agency is responsible for enabling authorized users to determine whether access authorizations assigned to the sharing partner match the access restrictions on the information being shared."
       }
      }
     ]
    },
    {
     "uuid": "904fa0ca-329f-4c6b-8ae2-a797cff6cc2f",
     "control-id": "ac-22",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "b327a256-7d29-4600-afe1-6839a3005bdc",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nPer the NIST SP 800-53 revision 4 supplemental guidance: This control addresses information systems that are controlled by the organization and accessible to the general public, typically without identification or authentication. The environment does not have publicly accessible content and requires users to authenticate before interacting with the system.\n\nApplication, Database, Operating System:  Per the NIST SP 800-53 revision 4 supplemental guidance: does not have publicly accessible content and requires users to authenticate before interacting with the system. is not accessible to the general public without identification or authentication. Access is only permitted to registered, authorized users with valid login credentials."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "89cc47a1-6b36-40fb-bc42-d73e7c9804f2",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe control is not applicable. Per the NIST SP 800-53 revision 4 supplemental guidance: This control addresses information systems that are controlled by the organization and accessible to the general public, typically without identification or authentication. does not have publicly accessible content and requires users to authenticate before interacting with the system.\n\nApplication, Database, Operating System:  Per the NIST SP 800-53 revision 4 supplemental guidance: does not have publicly accessible content and requires users to authenticate before interacting with the system. is not accessible to the general public without identification or authentication. Access is only permitted to registered, authorized users with valid login credentials."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "67acf8bc-7bf7-4b9d-840e-08895c93944c",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility\n\nThe control is not applicable. Per the NIST SP 800-53 revision 4 supplemental guidance: This control addresses information systems that are controlled by the organization and accessible to the general public, typically without identification or authentication. does not have publicly accessible content and requires users to authenticate before interacting with the system.\n\nApplication, Database, Operating System:  Per the NIST SP 800-53 revision 4 supplemental guidance: does not have publicly accessible content and requires users to authenticate before interacting with the system. is not accessible to the general public without identification or authentication. Access is only permitted to registered, authorized users with valid login credentials."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "3e08562b-f735-4de5-8fc6-838fb20f53e5",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility\n\nThe control is not applicable. Per the NIST SP 800-53 revision 4 supplemental guidance: This control addresses information systems that are controlled by the organization and accessible to the general public, typically without identification or authentication. does not have publicly accessible content and requires users to authenticate before interacting with the system.\n\nApplication, Database, Operating System:  Per the NIST SP 800-53 revision 4 supplemental guidance: does not have publicly accessible content and requires users to authenticate before interacting with the system. is not accessible to the general public without identification or authentication. Access is only permitted to registered, authorized users with valid login credentials.\n\n13.2. Awareness and Training (AT)"
       }
      }
     ]
    },
    {
     "uuid": "None",
     "control-id": "at-1",
     "by-component": []
    },
    {
     "uuid": "bedc6ddb-4c3e-410f-a315-4b2c8c868eb1",
     "control-id": "at-2",
     "by-component": [
      {
       "key": "05145a99-ef14-4c56-91fa-77f2cdce8521",
       "value": {
        "uuid": "46964552-1c02-4b57-99d8-10f5585a387e",
        "component-name": "HHS Security Policy",
        "description": "HHS Security Policy requires all end-users of HHS Systems to have annual security awareness training."
       }
      }
     ]
    },
    {
     "uuid": "None",
     "control-id": "at-2.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "at-3",
     "by-component": []
    },
    {
     "uuid": "0b34c5c9-6624-4e34-831a-7c0e22eb0c08",
     "control-id": "at-4",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "93da3ab1-6109-4e45-bde7-85f1cb3e90fc",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "Part b\n\n13.3. Audit and Accountability (AU)"
       }
      }
     ]
    },
    {
     "uuid": "None",
     "control-id": "au-1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-2.3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-3.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-5.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-5.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-6",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-6.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-6.3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-7",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-7.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-8",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-8.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-9.4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "au-11",
     "by-component": []
    },
    {
     "uuid": "41deed80-3835-4619-8eff-af0e6c1ac5d7",
     "control-id": "au-12",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "d224e035-2c6b-4fc5-b011-54e84ee57ac7",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "13.4. Security Assessment and Authorization (CA)"
       }
      }
     ]
    },
    {
     "uuid": "None",
     "control-id": "ca-1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ca-2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ca-2.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ca-3.5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ca-5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ca-6",
     "by-component": []
    },
    {
     "uuid": "d896c968-5bae-4570-b90e-73f5a6af9809",
     "control-id": "ca-7",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "39efb9af-8438-4863-b102-2800ea76bf74",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "CA-7 Additional FedRAMP Requirements and Guidance:\n\nRequirement 1: Operating System Scans: at least monthly\n\nRequirement 2: Database and Web Application Scans: at least monthly\n\nRequirement 3: All scans performed by Independent Assessor: at least annually\n\nCA-7 Req.\n\nControl Summary Information\n\nResponsible Role:\n\nImplementation Status (check all that apply):\n\n☐ Implemented\n\n☐ Partially implemented\n\n☐ Planned\n\n☐ Alternative implementation\n\n☐ Not applicable\n\nControl Origination (check all that apply):\n\n☐ Service Provider Corporate\n\n☐ Service Provider System Specific\n\n☐ Service Provider Hybrid (Corporate and System Specific)\n\n☐ Configured by Customer (Customer System Specific)\n\n☐ Provided by Customer (Customer System Specific)\n\n☐ Shared (Service Provider and Customer Responsibility)\n\n☐ Inherited from pre-existing FedRAMP Authorization for Click here to enter text. , Date of Authorization\n\nCA-7 What is the solution and how is it implemented?\n\nReq. 1\n\nReq. 2\n\nReq. 3"
       }
      }
     ]
    },
    {
     "uuid": "None",
     "control-id": "ca-7.1",
     "by-component": []
    },
    {
     "uuid": "46387460-66e1-478f-97b3-396f552b7e8c",
     "control-id": "ca-9",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "b89b4f3e-8828-46d0-9203-17882e2111c3",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "Part b\n\n13.5. Configuration Management (CM)"
       }
      }
     ]
    },
    {
     "uuid": "None",
     "control-id": "cm-1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-2.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-2.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-2.3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-2.7",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-3.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-3.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-4.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-5.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-5.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-5.3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-6",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-6.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-6.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-7",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-7.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-7.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-7.4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-8",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-8.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-8.3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-8.5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-9",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cm-10",
     "by-component": []
    },
    {
     "uuid": "23c0c58f-c657-4f41-a394-59b3a0168368",
     "control-id": "cm-11",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "a75f9da7-778f-4a5a-8690-314d5373d78b",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "13.6. Contingency Planning (CP)"
       }
      }
     ]
    },
    {
     "uuid": "None",
     "control-id": "cp-1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-2.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-2.3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-2.8",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-3.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-4.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-6",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-6.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-6.3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-7",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-7.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-7.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-7.3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-8",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-8.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-8.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-9",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-9.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "cp-9.2",
     "by-component": []
    },
    {
     "uuid": "3a651083-3f39-4059-8c54-13c242fb3001",
     "control-id": "cp-10.2",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "20f76074-8076-4189-aa07-19097034f130",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "13.7. Identification and Authentication (IA)"
       }
      }
     ]
    },
    {
     "uuid": "3c0e6c71-a391-414e-8f36-421f9efe9c77",
     "control-id": "ia-1",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "49683999-97d7-4b1c-ad22-08c5e2f0a259",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve E3LabIaaS Information Security Policy directs the activities within the Access Management Plan. The plan addresses purpose, scope, responsibilities (including management commitment), coordination among organizational entities, and compliance requirements to meet the FedRAMP control implementation requirements for the access control family of a moderate baseline. The plan specifically addresses procedures or processes related to:\n\n• Information Access Restriction\n\n• The Request Fulfillment Process for Provisioning Access\n\n• The Periodic Review of Access\n\n• The Revocation of Access\n\n• The Separation of Duties\n\n• Access Control to Program Source Code\n\n• Authenticator Device Management\n\n• Encryption\n\nAll procedures that are captured in Thanos, 2 Twelve Solution’s document repository management system, are reviewed on an annual basis by the 2 Twelve Leadership and ARB. The ARB consists of the InfraOps, CloudOps and relevant decision makers. The ARB is responsible for notifying stakeholders when changes are made and approved by the ARB. This may require the creation of new documentation or reviewing and updating current procedures, annually or as needed; and policies every 3 years or as needed.\n\nThe CloudOps and Management team are responsible for reviewing policies and procedures. The team composition includes the following:\n\n• CloudOps (Operations, Network, OS, Databases, Applications stakeholders); and\n\n• 2 Twelve Solution Leadership (CEO, System Owner; and Director of Engineering Services, InfraOps);"
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "10384a22-ad9b-46c7-a9fd-2068620493ba",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe ARB reviews and updates all E3LabIaas Information Security Policy at least every 3 years. CloudOps reviews and updates the E3LabIaas Procedures every year during the annual system review."
       }
      }
     ]
    },
    {
     "uuid": "3fcfb1d1-e29f-4824-b95c-7c4bbce65c63",
     "control-id": "ia-2",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "e54e3404-a378-41f7-849e-404aa8c6d657",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve uniquely identifies and authenticates organizational users. The E3LabIaaS environment uses the following technologies to uniquely identify and authenticate organizational users (as referenced in AC-2).\n\nApplication:\n\nCustomer Authentication through SSO or MFA\n\nApplication front end users must authenticate through MFA or SAML 2.0 token. The application(s) are responsible for providing data in transit encryption, as required according to their organizational policy, to protect the communication session. 2 Twelve administrators do not have access to client applications.\n\nOperating System: Each user has a unique username and associated SSH key on the host. Usernames are defined in the format of firstname.lastname. In the case of multiple personnel with the same name, numerical values are added at the end of the username.\n\nAdministrator access for all devices within the environment requires key authentication to the host. This is done by installing the administrator’s SSH public key onto the hosts that they have a need to access. 2 Twelve admins do not have direct access to customer data.  They have admin access to the OS level and files residing on the filesystem; however they are only allowed limited direct access to the hosts to perform troubleshooting, as required, and all administrative actions must be performed through automation. Patches and updates are accomplished through Ansible.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure information system uniquely identifies and authenticates organizational users."
       }
      }
     ]
    },
    {
     "uuid": "23b37b92-2e8f-4eb7-9914-3e99186a61b3",
     "control-id": "ia-2.1",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "384db4ba-2046-43f2-88fe-728ebdac6af6",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve requires MFA for network access to privileged accounts. Infrastructure access requires authentication using a FIPS 140-2 validated token. After the creation of a customer admin account during the customer onboard process, 2 Twelve administrators have limited access to the host.\n\nApplication, Database and Operating System:  Access to the tools and infrastructure requires MFA authentication. Infrastructure access requires authentication to the host using a FIPS 140-2 validated token. All users must have a valid SSH key. Users must have a matching public SSH key on the operational system to establish connection with that host. 2 Twelve admins do not have direct access to customer data. All routine 2 Twelve administration and management activities are conducted through automation.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure the information system implements multifactor authentication for network access to privileged accounts."
       }
      }
     ]
    },
    {
     "uuid": "a5644454-fc89-4e30-92d0-3996f9732bf7",
     "control-id": "ia-2.2",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "07e9807e-ba4e-4a9a-ab5e-26393eb8f8bf",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nApplication: Application accesses are specific to each customer. 2 Twelve admins do not have access to customer application. 2 Twelve admins can only access the OS layer of those instances.\n\nOperating System: Only authorized privileged 2 Twelve administrators access operating systems. There are no non-privilege users/accounts access to the host and OS.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure the information system implements multifactor authentication for network access to non-privileged accounts."
       }
      }
     ]
    },
    {
     "uuid": "3aadd071-9803-4682-955a-b14af35223ef",
     "control-id": "ia-2.3",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "2a692fea-0e85-4c73-9be3-e3a54e33b4bd",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nE3LabIaaS is built on the 2 Twelve Multi-Cloud hosted in a Tier 3 data center in Reston, VA. 2 Twelve CloudOps admins and Customer admins have no local access to any physical assets within the boundary.\n\nApplication, Database, Operating System:  Administrators do not have access local access to the underlying physical infrastructure. Only specific personnel categorized as Infrastructure Operations (InfraOps) have local access to the physical infrastructure but have no local access to the virtual hosts (virtual machine / Operating System and above)."
       }
      }
     ]
    },
    {
     "uuid": "778764f7-847d-4d3d-bd68-b74e04820851",
     "control-id": "ia-2.8",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "81952dcc-d73b-4a85-933e-85506a3bb809",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nApplication: 2 Twelve managed E3LabIaaS applications utilize TLS 1.2 or greater. All access is authenticated. Customer application accesses are specific to each customer. E3LabIaaS admins do not have access to customer application. After the creation of a customer admin account during the customer onboard process, E3LabIaaS administrators have no access to the customer application. 2 Twelve admins can only access the OS layer of those instances.\n\nOperating System: Authorized 2 Twelve administrators access operating systems by authenticating via SSH to the host. All users must have a valid unique SSH key and must have a matching public SSH key on the operational system to establish connection with that host.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure the information system implements replay-resistant authentication mechanisms for network access to privileged accounts."
       }
      }
     ]
    },
    {
     "uuid": "db509065-3989-4398-8aba-4bab1d478cc8",
     "control-id": "ia-2.11",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "0d8e483a-f10f-4843-97ed-324a248c24fd",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nApplication: E3LabIaaS application accesses are specific to each customer. E3LabIaaS admins do not have access to customer application. After the creation of a customer admin account during the customer onboard process, E3LabIaaS administrators have no access to the customer application. 2 Twelve admins can only access the OS layer of those instances.\n\nOperating System: Authorized 2 Twelve administrators access operating systems by authenticating via SSH to the host. All users must have a valid unique SSH key and must have a matching public SSH key on the operational system to establish connection with that host.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure the information system implements multifactor authentication for remote access to privileged and non-privileged accounts such that is provided by a device separate from the system gaining access and the device meets FIPS 140-2 compliance."
       }
      }
     ]
    },
    {
     "uuid": "591784ed-a9ed-4416-a4ea-4db9a19eb16d",
     "control-id": "ia-2.12",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "0e875c26-09d8-4663-a493-a7dabdbc55a5",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve accepts and electronically verifies PIV cards and CAC through interaction with customer identity management solutions. Customer accounts maintained on customer Identity Management systems will be used for application access. 2 Twelve managed E3LabIaaS applications will accept SAML 2.0 tokens from customer Identity Access Management System. These users would connect to E3LabIaaS applications using HTTPS with TLS v1.2 utilizing customer provided credentials. Typically this would include a user ID, password or PIN and a Personal Identity Verification (PIV) card or Common Access Card (CAC).\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure the information system accepts and electronically verifies Personal Identity Verification (PIV) credentials."
       }
      }
     ]
    },
    {
     "uuid": "0fa95448-bbcc-4ccc-8020-3585db69dad8",
     "control-id": "ia-3",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "494781bb-dab0-42e8-89a7-098ac9f6e7f6",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve uniquely identifies all devices based on its assigned IP address and hostname. The assigned private IP address is used to identify network devices and an SSH key verification is used to authenticate the servers and network devices before a connection is established.\n\nApplication, Database, Operating System:  2 Twelve uniquely identifies all devices based on its assigned IP address and hostname. The assigned private IP address is used to identify network devices and an SSH server key verification is used to authenticate the servers and network devices before a connection is established. The hardware inventory provided in this SSP for information on IP address and hostnames assigned to devices within the 2 Twelve E3LabIaaS environment.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure all devices are being uniquely identified and authenticated before establishing remote connection to applications."
       }
      }
     ]
    },
    {
     "uuid": "dd52c348-55f0-4f3b-a646-eec5b72d1ce8",
     "control-id": "ia-4",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "a7fa2ab0-c303-4e04-af99-0cabc21ce449",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe organization requires an authorization in the form of an access authorization ticket, approved prior to assignment of an identifier. Customer account manager will provide the final approval in service ticket for CloudOps to provision the new user and relevant privileges. Individuals receive unique identifiers in the form of User ID (UID). E3LabIaaS utilizes instance hostname and IP addresses as device identifier. Change requests will go through the ARB for new server instances and requirements.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure an organization-defined person or personnel are assigned to approve authorizations for individual, group or role identifier."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "1d94a6e1-16ee-44cf-9897-3df13792ac56",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve uses a naming convention for user accounts that follows [first name].[last name]. In the case of multiple personnel with the same name, numerical values are added at the end of the username.\n\nDevice E3LabIaaS utilizes instance hostname and IP addresses as device identifier. The E3LabIaaS inventory contains the IP address and host name associated with each device within the authorization boundary.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to select an identifier for individual, group, role or device for their application."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "ffa1a909-4f93-4aa1-ae63-82919706430e",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nAccount IDs, are assigned as part of the initial onboarding process. This process is tracked using service tickets. In addition, Device IDs are assigned as part of launching of the system. This process is also tracked using Service tickets.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to assign the identifier to the intended individual, group, role or device."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "73474a14-f3ad-499c-a2f4-7d62dfa7e227",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve does not reuse any account names or identifiers.\n\nApplication: E3LabIaaS tools (logging, security scanning) accounts can be deactivated. Account creation and disablement requires approval through a service ticket. When accounts are no longer needed, they are disabled or inactivated, but never removed.\n\nE3LabIaaS instances are identified by the hostname and IP address. The E3LabIaaS inventory contains the IP address and host name associated with each device within the authorization boundary.\n\nOperating System: 2 Twelve uses a naming convention for user accounts that follows [first name].[last name]. In the case of multiple personnel with the same name, numerical values are added at the end of the username. Account disablement is done through ansible, when accounts are to be disabled, the account name is maintained as commentary within the user list.\n\nDevice E3LabIaaS utilizes instance hostname and IP addresses as device identifier. The E3LabIaaS inventory contains the IP address and host name associated with each device within the authorization boundary. When new instances are deployed, CloudOps to review to ensure new instances does not reuse any disabled identifier within the past 2 years.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to prevent the reuse of identifiers for at least two years."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "9ceaea79-c811-43e3-81a4-c0c2d914d179",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nApplication:  Account inactivity is enforced through account policies in the SSO solution. Accounts are disabled after 60 days of inactivity.\n\nOperating System:  Account inactivity is enforced through password expiration. Hosts password are configured to expire after 60 days.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to disable the identifier after at least ninety days of inactivity."
       }
      }
     ]
    },
    {
     "uuid": "ece39a08-614b-4323-9f52-5bad7a62621c",
     "control-id": "ia-5",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "0d4c0126-506e-4cec-8326-4ccd403707a0",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve personnel who require administrator access to the E3LabIaaS environment are verified as part of the hiring process. The hiring process includes a background check to include the verification of the individual’s identity and address. As part of the team onboarding process the 2 Twelve personnel with administrator access to E3LabIaaS creates required unique SSH keys pair.\n\nFor the infrastructure authentication process, the first step requires the user’s private SSH key to authenticate against the public SSH key on the host, access to the private key is protected through a secret passphrase. Unique identifiers are established for each 2 Twelve E3LabIaaS administrator account through unique user IDs. User accounts and initial temporary passwords will be set up as follows:\n\n• The CloudOps team creates user accounts and distributes initial temporary passwords through email, or by separate channels such as slack or phone.\n\n• Initial temporary passwords cannot be blank and must be set to force change at first login.\n\n• Each user must have a unique ID and password, and may not access environments without individual identification.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to verify the identity of the individual, group, role or device as part of the initial authenticator distribution."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "32c9b6e7-fe12-40e1-8b3d-b61014155a4b",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "his control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve personnel who require administrator access to the E3LabIaaS environment are verified as part of the hiring process. The hiring process includes a background check to include the verification of the individual’s identity and address. As part of the team onboarding process the 2 Twelve personnel with administrator access to E3LabIaaS creates required unique SSH keys pair.\n\nFor the infrastructure authentication process, the first step requires the user’s private SSH key to authenticate against the public SSH key on the host, access to the private key is protected through a secret passphrase. Unique identifiers are established for each 2 Twelve E3LabIaaS administrator account through unique user IDs. User accounts and initial temporary passwords will be set up as follows:\n\n• The CloudOps team creates user accounts and distributes initial temporary passwords through email, or by separate channels such as slack or phone.\n\n• Initial temporary passwords cannot be blank and must be set to force change at first login.\n\n• Each user must have a unique ID and password, and may not access environments without individual identification.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to verify the identity of the individual, group, role or device as part of the initial authenticator distribution."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "980ec784-dbcd-4ea5-b484-5e8cdd766ade",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve Policy and Procedures Identification and Authentication, governs 2 Twelve E3LabIaaS user accounts and authenticators. Issued passwords meet 2 Twelve policy requirements respectively for password complexity.\n\nStrong passwords and passphrases must meet the following requirements:\n\n• Contain at least twelve alphanumeric characters\n\n• Contain both upper and lower case letters.\n\n• Contain at least one number (for example, 0-9).\n\n• Contain at least one special character (for example,!$%^&*()_+|~-=\\`{}[]:\";'<>?,/)\n\nApplication: 2 Twelve managed application credentials are consistent with requirements in IA-5(1). Customer access to 2 Twelve managed applications use HTTPS with TLS v1.2 utilizing customer provided credentials.\n\nOperating System:  Authorized 2 Twelve administrators access operating systems by authenticating via SSH to the host.  All users must have a valid SSH key. 2 Twelve utilizes SSH key pairs generated using at least RSA 2048 bit  size key or ECC of equivalent strength.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure that authenticators have sufficient strength of mechanism for the application environment."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "ef896066-e98d-49bf-b0cd-855540f568da",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nLost, compromised, or damaged authenticators are revoked from being used. Users are required to report to their managers when passwords are lost, compromised, or damaged. The 2 Twelve Access and Identity Management Plan establish procedure for administrating authenticators.\n\nWhen a FIPS 140-2 authenticator needs to be replaced due to damage, loss, or theft an administrator revokes the authenticator. 2 Twelve employees are responsible for protecting authenticator devices used in accessing E3LabIaas environments. For lost, stolen, compromised or damaged authenticator devices, employees must immediately perform the following steps:\n\n• Send an email to CloudOps explaining that the device can no longer be used and include the reason\n\n• CloudOps reinitiates a new token to the user following the setup process once the user obtains a new device\n\nCustomer Responsibility:\n\nIt is the customer responsibility to establish and implement administrative procedures for initial authenticator distribution, for lost/compromised or damaged authenticators, and for revoking authenticators for the E3LabIaas application environment."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "71ce2cb2-fcf3-4fd9-a05c-d2b6ac046b17",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nAll user passwords for access to the 2 Twelve E3LabIaas environment are required to be changed upon initial user logon. All default authenticators are required to be changed for all new components that are added to the 2 Twelve E3LabIaas environment.\n\nApplication, Database, Operating System:  All default authenticators are required to be changed for all new components that are added to the 2 Twelve E3LabIaas environment. Installation of new devices must comply with the password complexity requirements outlined in control IA-5(1). Default passwords for devices in the authorization boundary are changed prior to go live. The current Ansible playbook update configurations to prevent the root account from being used for remote access during the initial deployment of the instance.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure the default content of authenticators are changed prior to information system installation for the E3LabIaas application environment."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "893d104e-d287-4806-81ee-9e7b544bd76b",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nApplication: E3LabIaas tools enforce minimum and maximum lifetime restriction and reuse conditions. Minimum lifetime is set at minimum of 1 day, maximum lifetime is set at 90 days, and reuse conditions are set at 24.\n\nOperating System:  All hosts instances enforce minimum and maximum lifetime restriction and reuse conditions. Minimum lifetime is set at minimum of 1 day, maximum lifetime is set at 90 days, and reuse conditions are set at 24.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to establish minimum and maximum lifetime restrictions and reuse conditions for authenticators for the E3LabIaas application environment."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "f3333954-1373-4340-a1bb-29babf85fbef",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nE3LabIaas enforce refreshing authenticators through password expiration setting. For all password settings, password expiration is set for 60 or 90 days, defined as the maximum lifetime restriction.\n\nApplication: E3LabIaas tools enforce minimum and maximum lifetime restriction and reuse conditions. Minimum lifetime is set at minimum of 1 day, maximum lifetime is set at 90 days, reuse conditions are set at 24\n\nOperating System:  The bastion host and all hosts instances enforce minimum and maximum lifetime restriction and reuse conditions. Minimum lifetime is set at minimum of 1 day, maximum lifetime is set at 90 days, and reuse conditions are set at 24.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to change or refresh authenticators within their organizational defined time period for all authenticators for the E3LabIaas application environment."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "e06b48f2-dd02-4bf1-a717-930d48749bbb",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve administrators are required to protect authenticator content from unauthorized disclosure and modification. The protection of authenticator content is required under the 2 Twelve E3LabIaas Rules of Behavior and the Access and Identify Management Plan. Users who do not comply with the 2 Twelve E3LabIaas Rules of Behavior may incur disciplinary action, including but not limited to employment termination and/or criminal prosecution.\n\nApplication: E3LabIaas tools obscure feedback of authentication during the authentication process and does not display password in plain text.\n\nOperating System: All OS instances obscure feedback of authentication during the authentication process and does not display password in plain text. SSH passwords are stored in hashed format using SHA-512.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to protect authenticator content from unauthorized disclosure and modification for all accounts with access to the E3LabIaas application environment."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "d85dcd15-2243-43d8-bd39-236f5fa2679f",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nCloudOps maintains password management system features and functionality to include:\n\n• Allow users to select and change their own passwords and include a confirmation procedure to allow for input errors\n\n• Enforce password complexity\n\n• Force users to change their passwords at first log-on\n\n• Enforce regular password changes with a maximum password lifetime of 60 or 90 days\n\n• Obscure passwords on the screen when being entered\n\n• Authenticators are encrypted in storage and transmission\n\nApplication, Database, Operating System:  2 Twelve maintains password management system features and functionality. The 2 Twelve Rules of Behavior document the require security safeguards. The Rules of Behavior is signed by all members of CloudOps. The protection of authenticator content is required under the 2 Twelve E3LabIaas Rules of Behavior. Users who do not comply with the 2 Twelve E3LabIaas Rules of Behavior may incur disciplinary action, including but not limited to employment termination and/or criminal prosecution. In addition, all local passwords are stored within Linux as hashed values.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure requires individuals to take, and have devices implement, specific security safeguards to protect authenticators for the E3LabIaas application environment."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "1f93774f-fbee-443e-8f23-490dad190d78",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nE3LabIaas does not utilize group accounts.\n\nApplication, Database, Operating System:  This part of IA-5 is not applicable for the E3LabIaas environment as 2 Twelve E3LabIaas does not utilize group accounts.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to change authenticators for group/role accounts when membership to those accounts changes for the E3LabIaas application environment."
       }
      }
     ]
    },
    {
     "uuid": "355a2b97-70f6-4be7-8144-1f8a1bcfadbd",
     "control-id": "ia-5.1",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "5d3fd8dc-6f5e-48c1-b030-48f6545baaf7",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve enforces minimum password complexity requirements for 2 Twelve E3LabIaas password-based authentication.\n\nStrong passwords and passphrases must meet the following requirements:\n\n• Contain at least twelve alphanumeric characters in accordance with NIST SP 800-63B Memorized Secret (Section 5.1.1) Guidance\n\n• Contain both upper and lower case letters.\n\n• Contain at least one number (for example, 0-9).\n\n• Contain at least one special character (for example,!$%^&*()_+|~-=\\`{}[]:\";'<>?,/).\n\nApplication: E3LabIaas tools enforce password complexity and length via SSO and identity provider configurations.\n\nOperating System:  All hosts instances enforce key only SSH access. CloudOps has the admin privilege to edit those settings through ansible playbook.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to enforce minimum password complexity to include the following organization-defined requirements for case sensitivity, number of characters, mix of upper-case letters, lower-case letters, numbers, and special characters for the E3LabIaas application environment."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "2b923ef8-5e1d-4f41-9b38-42263e7bdc6a",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nAll passwords must have at least one (1) new character when changed. This is enforced through password reuse, users cannot change the new password with his or her existing password.\n\nApplication: E3LabIaas tools enforce minimum and maximum lifetime restriction and reuse conditions. Minimum lifetime is set at minimum of 1 day, maximum lifetime is set at 60 days, reuse conditions are set at 24.\n\nOperating System:  All hosts instances enforce minimum and maximum lifetime restriction and reuse conditions. Minimum lifetime is set at minimum of 1 day, maximum lifetime is set at 90 days, and reuse conditions are set at 24.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to enforce that when new passwords are created at least one character must be changed for the E3LabIaas application passwords and/or passphrases."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "92a9244d-501a-4827-baa1-40d6b5a0a669",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nE3LabIaas authenticators are encrypted in storage and transmission. E3LabIaas does not have any passwords or authenticators transmit or store in clear text within or across the authorization boundary.\n\nApplication: E3LabIaas tools obscure feedback of authentication during the authentication process and does not display password in plain text.\n\nOperating System: All OS instances obscure feedback of authentication during the authentication process and does not display password in plain text. SSH passwords are hashed using SHA-512.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to store and transmit only cryptographically-protected passwords."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "b6d4b46f-2e3e-497b-babf-2f04df5013f3",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve has established minimum and maximum lifetime restrictions, where configurable, as follows:\n\n• Minimum and password ages are not configurable\n\n• Maximum password age of 90 days\n\nApplication, Database, Operating System:  2 Twelve has established minimum and maximum lifetime restrictions. The above minimum and maximum lifetime restrictions apply for the E3LabIaas tools and operating system. SHA-512 hashing is used to protect SSH passwords from disclosure and modification.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to enforce a password minimum and maximum lifetime restrictions."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "6337b416-3ef8-4617-92f7-50fd78fdf0b0",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve prohibits password reuse of, at least, twenty-four generations within the 2 Twelve E3LabIaas environment. The CloudOps team is responsible for the implementation and configuration of the password reuse restrictions for 2 Twelve managed applications.\n\nApplication: E3LabIaas tools enforce minimum and maximum lifetime restriction and reuse conditions. Minimum lifetime is set at minimum of 1 day, maximum lifetime is set at 90 days, reuse conditions are set at 24\n\nOperating System:  All hosts instances enforce key only SSH access\n\nCustomer Responsibility:\n\nIt is the customer responsibility to prohibits password reuse as required by the organizational policy for the E3LabIaas application."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "859074e8-9529-49fb-848f-8ff7b0b70cf9",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve uses temporary passwords as a part of the onboarding process for new hires and requires that the password is changed after the initial log in by the user. CloudOps is responsible for configuring each user account to immediately prompt for a new password after the initial login.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to allow the use of a temporary password for system logons with an immediate change to a permanent password for the E3LabIaas application."
       }
      }
     ]
    },
    {
     "uuid": "781bec2b-acb1-496d-a6c0-edd0242c317c",
     "control-id": "ia-5.2",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "a0131899-2943-428a-bb5e-5caf75d2fda0",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nCertificate based PKI authentication is not used within 2 Twelve E3LabIaas infrastructure to access any components within the authorization boundary. 2 Twelve E3LabIaas offers the capability to customer to enable PKI based authentication and let the customer choose and make a selection.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to validate certifications by constructing and verifying a certification path to an accepted trust anchor including checking certificate status information."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "458d5032-e908-4b55-a29e-89cc1b643280",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nCertificate based PKI authentication is not used within 2 Twelve E3LabIaas infrastructure to access any components within the authorization boundary. 2 Twelve E3LabIaas offers the capability to customer to enable PKI based authentication and let the customer choose and make a selection.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to enforce authorized access to the corresponding private key for the E3LabIaas application."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "760fee65-ca55-4c8f-ae88-c602d2f2baf4",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nCertificate based PKI authentication is not used within 2 Twelve E3LabIaas infrastructure to access any components within the authorization boundary. 2 Twelve E3LabIaas offers the capability to customer to enable PKI based authentication and let the customer choose and make a selection.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to map the authenticated identity to the account of the individual or group."
       }
      },
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "f7aee229-a701-431c-bb3f-29940a8cad4b",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nCertificate based PKI authentication is not used within 2 Twelve E3LabIaas infrastructure to access any components within the authorization boundary. 2 Twelve E3LabIaas offers the capability to customer to enable PKI based authentication and let the customer choose and make a selection.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to implement a local cache of revocation data to support path discovery and validation in case of inability to access revocation information via the network."
       }
      }
     ]
    },
    {
     "uuid": "a61dc73a-b920-4cde-a35d-b53f7cf3de27",
     "control-id": "ia-5.3",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "cea1eb1b-cf1c-48c2-b68e-f948ecbe5a98",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve requires that the registration process to receive all hardware authenticators be conducted in person with their manager or 2 Twelve appointed representative. As part of the initial authenticator distribution, 2 Twelve verifies the identity of the individual, group, role, or device  receiving the authenticator.\n\nApplication, Database, Operating System:  As part of the initial authenticator distribution, 2 Twelve verifies the identity of the individual, group, role, or device receiving the authenticator. The individual’s manager or 2 Twelve appointed representative are responsible for verifying the identity of individual users prior to issuing all hardware multi-factor authenticators.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure that the registration process to receive all multifactor authenticators comply with their organization’s policies"
       }
      }
     ]
    },
    {
     "uuid": "2e2501fc-b47e-499d-8c3a-814a56ac1ed5",
     "control-id": "ia-5.11",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "ab3cc384-8e70-4ca6-b3aa-80a3d9e6f166",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve establishes MFA hardware-based tokens that employ the Time-based One-time Password (TOTP) algorithm for infrastructure access. The token used in the E3LabIaas environment for SSH authentication into the hosts.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure that for hardware token-based authentication employs mechanisms that satisfy their organizational requirements for access to the E3LabIaas application."
       }
      }
     ]
    },
    {
     "uuid": "63f1cdc0-3059-4217-9aec-dc7b955feeef",
     "control-id": "ia-6",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "1aa1406e-1a19-4906-be28-684f2daacc54",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\n2 Twelve obscures authenticator feedback via built-in operating system settings that protect password inputs when the authentication process occurs. Authenticator feedback are either hidden or obscured with the use of asterisks (*). Additionally, 2 Twelve obscures authenticator feedback for customer-facing web applications and passwords are displayed as asterisks at the login screen.\n\nApplication: E3LabIaas tools obscure password via SSO and identity provider configurations.\n\nOperating System:  All hosts instances enforce key only SSH access. CloudOps has the admin privilege to edit those settings through ansible playbook.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure the information system obscures feedback of authentication information during the authentication process to protect the information from possible exploitation/use by unauthorized individuals."
       }
      }
     ]
    },
    {
     "uuid": "a6d18bd0-e367-4deb-adcf-8f9a9a21d6fa",
     "control-id": "ia-7",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "1c7369d0-424f-4a85-b5ae-d09e0ae282c7",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nE3LabIaas implements FIPS-validated cryptographic modules, which provide mechanisms for authentication to a cryptographic module which meet the requirements of applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance for such authentication. All access to the applications via web service and API are through reverse proxies which enforce HTTPS via TLS v1.2.\n\nApplication: Access to 2 Twelve managed applications occurs over HTTPS via TLS v1.2 or above.\n\nOperating System: Authorized 2 Twelve administrators access operating systems by authenticating through the host via SSH. All users must have a valid SSH key. 2 Twelve utilizes SSH key pairs generated using RSA 2048 bit size key or greater strength. Users must have a matching public SSH key on the operating system to establish connection with that host.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure the information system implements mechanisms for authentication to a cryptographic module that meet the requirements of applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance for such authentication."
       }
      }
     ]
    },
    {
     "uuid": "81217aed-d03a-4e66-bc1f-961c4977c6bd",
     "control-id": "ia-8",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "a6d9bfea-158f-4ab2-99a0-bc3427489fa3",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nThe only non-organizational users that authenticate to the system are customer users. Customer users authenticate to their own agencies’ identity management solutions and access E3LabIaas with a SAML token presented by the customer identity management solution. Customer requirements are detailed throughout the IA-2(2) controls.\n\nApplication, Database, Operating System:  There are no non-organizational users with access to the E3LabIaas. The only non-organizational users that authenticate to the system are customer users. Customer users authenticate to their own agencies’ identity management solutions and access E3LabIaas with a SAML token presented by the customer identity management solution. 2 Twelve E3LabIaas supports federated authentication for user SSO using SAML 2.0 or MFA.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure the information system uniquely identifies and authenticates non-organizational users to the E3LabIaas application."
       }
      }
     ]
    },
    {
     "uuid": "1fe5edba-9f49-45ec-9fea-e6cd03582edf",
     "control-id": "ia-8.1",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "f7faf081-744a-43ab-8193-fdc752c0e8d3",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nVerification of PIV credentials is a customer responsibility and will be carried out by customer identity management systems. After successful authentication SAML assertions will be transmitted from the customer identity management systems to E3LabIaas.\n\nApplication, Database, Operating System:  Customers are responsible for implementing PIV cards and CAC if they choose to. The E3LabIaas application lets the customer implement the SAML 2.0 SSO of their choosing. After authentication, SAML assertions will be transmitted from the customer identity management systems to E3LabIaas system.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to enable and verify Personal Identity Verification (PIV) credentials from other federal agencies."
       }
      }
     ]
    },
    {
     "uuid": "101767ed-5814-4c03-a20a-bb6964c7db56",
     "control-id": "ia-8.2",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "15406ac2-21d0-457a-9f8f-b9edb4e3bb98",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nAll verification of third party credentials will be carried out by customer identity management systems. It is a customer responsibility to configure their identity management systems to accept only FICAM-approved third-party credentials.\n\nApplication, Database, Operating System: The E3LabIaas environment accepts FICAM credentials in the form of a SAML token; however this control requirement is met by the customer’s implementation. Customers are responsible to configure their identity management systems to accept only FICAM-approved third-party credentials. The E3LabIaas application lets the customer implement the SAML 2.0 SSO of their choosing.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure that their multifactor authentication solution accepts only FICAM-approved third-party credentials."
       }
      }
     ]
    },
    {
     "uuid": "895b35c8-0893-4236-8be7-582ea3e931b7",
     "control-id": "ia-8.3",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "bc37a347-da23-41c9-8b60-be2068c2fb03",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nAll verification of third party credentials will be carried out by customer identity management systems. It is a customer responsibility to employ only FICAM-approved information system components in their identity management system to accept third-party credentials.\n\nApplication, Database, Operating System: Customers are responsible for employing only FICAM-approved information system components. The E3LabIaas application lets the customer implement the SAML 2.0 SSO of their choosing.\n\nCustomer Responsibility:\n\nIt is the customer responsibility to ensure that their organization employs only FICAM- approved information system components in their SSO solutions accept third-party credentials."
       }
      }
     ]
    },
    {
     "uuid": "9c4b9442-1d0f-4b0f-9262-7a3e0b065e00",
     "control-id": "ia-8.4",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "3a72839f-296f-43c1-b873-a22a01b7b286",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "This control is reviewed at least annually or as needed by the ISSO and SO.\n\n2 Twelve Responsibility:\n\nE3LabIaas accepts SAML tokens from customer identity management systems, it does not establish identity management standards for any Federal entity, implement CAC or PIV identification or authentication solutions or issue CACs or PIV cards.\n\nApplication, Database, Operating System: E3LabIaas accepts SAML tokens from customer identity management systems, it does not establish identity management standards for any Federal entity, implement CAC or PIV identification or authentication solutions or issue CACs or PIV cards. It is a customer responsibility to configure their identity management systems to conform to FICAM-issued profiles.\n\nCustomer Responsibility:\n\nIt is a customer responsibility to implement identity management systems that conform to FICAM-issued profiles.\n\n13.8. Incident Response (IR)"
       }
      }
     ]
    },
    {
     "uuid": "None",
     "control-id": "ir-1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ir-2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ir-2.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ir-2.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ir-3.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ir-4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ir-4.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ir-5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ir-5.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ir-6",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ir-6.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ir-7",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ir-7.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ir-8",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ma-1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ma-2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ma-3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ma-3.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ma-3.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ma-4.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ma-4.3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ma-5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ma-5.1",
     "by-component": []
    },
    {
     "uuid": "b5ad21d9-249a-44b4-be4b-f7ae53117681",
     "control-id": "ma-6",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "ebe1e755-5885-417b-885e-4797a0534346",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "13.10. Media Protection (MP)"
       }
      }
     ]
    },
    {
     "uuid": "None",
     "control-id": "mp-1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "mp-2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "mp-3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "mp-4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "mp-5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "mp-5.4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "mp-6",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "mp-7",
     "by-component": []
    },
    {
     "uuid": "342c3db6-b686-45b0-8475-c415c7419db4",
     "control-id": "mp-7.1",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "6b1fa896-43fa-4c09-9b64-dbe31f96b4d3",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "13.11. Physical and Environmental Protection (PE)"
       }
      }
     ]
    },
    {
     "uuid": "None",
     "control-id": "pe-1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-3.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-6",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-6.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-6.4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-8",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-8.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-9",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-10",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-11",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-11.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-12",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-13.3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-14",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-15",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-15.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-16",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pe-17",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pl-1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pl-2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pl-2.3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pl-4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "pl-4.1",
     "by-component": []
    },
    {
     "uuid": "67f0300e-e80e-4893-954c-f4b09579e83b",
     "control-id": "pl-8",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "cf9f2e32-f64e-42ae-9fe8-632b8d3cc5d0",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "13.13. Personnel Security (PS)"
       }
      }
     ]
    },
    {
     "uuid": "None",
     "control-id": "ps-1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ps-2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ps-3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ps-4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ps-4.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ps-5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ps-6",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ps-7",
     "by-component": []
    },
    {
     "uuid": "47d27678-23d4-4d76-b704-9a4035688aa3",
     "control-id": "ps-8",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "e96ff1ae-656e-4254-b1c6-ecd499d6dde5",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "Part b\n\n13.14. Risk Assessment (RA)"
       }
      }
     ]
    },
    {
     "uuid": "None",
     "control-id": "ra-1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ra-2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ra-3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ra-5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ra-5.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ra-5.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "ra-5.5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sa-1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sa-2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sa-3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sa-4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sa-4.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sa-4.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sa-4.9",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sa-4.10",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sa-5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sa-8",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sa-9",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sa-9.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sa-10",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sa-11",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-7",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-7.3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-7.4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-7.5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-7.7",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-8",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-8.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-10",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-12",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-13",
     "by-component": []
    },
    {
     "uuid": "82210bdb-d6c8-4b3a-b29f-96dfc6028886",
     "control-id": "sc-15",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "79a38e93-1251-4f83-8f9d-314baba250f8",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "Part b\n\nSC-15 Additional FedRAMP Requirements and Guidance:\n\nRequirement: The information system provides disablement (instead of physical disconnect) of collaborative computing devices in a manner that supports ease of use.\n\nSC-15 Req.\n\nControl Summary Information\n\nResponsible Role:\n\nImplementation Status (check all that apply):\n\n☐ Implemented\n\n☐ Partially implemented\n\n☐ Planned\n\n☐ Alternative implementation\n\n☐ Not applicable\n\nControl Origination (check all that apply):\n\n☐ Service Provider Corporate\n\n☐ Service Provider System Specific\n\n☐ Service Provider Hybrid (Corporate and System Specific)\n\n☐ Configured by Customer (Customer System Specific)\n\n☐ Provided by Customer (Customer System Specific)\n\n☐ Shared (Service Provider and Customer Responsibility)\n\n☐ Inherited from pre-existing FedRAMP Authorization for Click here to enter text. , Date of Authorization\n\nSC-15 What is the solution and how is it implemented?\n\nReq. 1"
       }
      }
     ]
    },
    {
     "uuid": "None",
     "control-id": "sc-17",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-18",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-19",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-20",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-21",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-22",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-23",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "sc-28",
     "by-component": []
    },
    {
     "uuid": "7bc09c94-7a5d-4c76-a367-052417820734",
     "control-id": "sc-39",
     "by-component": [
      {
       "key": "9495ef6e-0ed5-46a2-9376-6b953e07e2bb",
       "value": {
        "uuid": "50ba6a4d-41e8-4758-b3a0-e7f9223b60f3",
        "component-name": "2 Twelve E3 Labs (System)",
        "description": "13.17. System and Information Integrity (SI)"
       }
      }
     ]
    },
    {
     "uuid": "None",
     "control-id": "si-1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-2.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-3",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-3.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-3.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-4.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-4.4",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-4.5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-5",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-7",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-7.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-7.7",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-8",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-8.1",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-8.2",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-10",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-11",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-12",
     "by-component": []
    },
    {
     "uuid": "None",
     "control-id": "si-16",
     "by-component": []
    }
   ],
   "revision-history": [
    {
     "published": "2019-06-01T00:00:00.00-04:00",
     "version": "1.0",
     "oscal-version": "1.0-Milestone3",
     "properties": [
      {
       "name": "party-uuid",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "6b286b5d-8f07-4fa7-8847-1dd0d88f73fb"
      }
     ],
     "remarks": "Initial publication."
    },
    {
     "published": "2020-06-01T00:00:00.00-04:00",
     "version": "2.0",
     "oscal-version": "1.0-Milestone3",
     "properties": [
      {
       "name": "party-id",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "csp"
      }
     ],
     "remarks": "Updated for annual assessment."
    }
   ],
   "properties": [
    {
     "name": "marking",
     "value": "Controlled Unclassified Information"
    }
   ],
   "roles": [
    {
     "id": "prepared-by",
     "title": "Prepared By",
     "desc": "The organization that prepared this SSP. If developed in-house, this is the CSP itself."
    },
    {
     "id": "prepared-for",
     "title": "Prepared For",
     "desc": "The organization for which this SSP was prepared. Typically the CSP."
    },
    {
     "id": "content-approver",
     "title": "System Security Plan Approval",
     "desc": "The individual or individuals accountable for the accuracy of this SSP."
    },
    {
     "id": "cloud-service-provider",
     "title": "Cloud Service Provider",
     "short-name": "CSP"
    },
    {
     "id": "system-owner",
     "title": "Information System Owner",
     "desc": "The individual within the CSP who is ultimately accountable for everything related to this system."
    },
    {
     "id": "authorizing-official",
     "title": "Authorizing Official",
     "desc": "The individual or individuals who must grant this system an authorization to operate."
    },
    {
     "id": "authorizing-official-poc",
     "title": "Authorizing Official's Point of Contact",
     "desc": "The individual representing the authorizing official."
    },
    {
     "id": "system-poc-management",
     "title": "Information System Management Point of Contact (POC)",
     "desc": "The highest level manager who responsible for system operation on behalf of the System Owner."
    },
    {
     "id": "system-poc-technical",
     "title": "Information System Technical Point of Contact",
     "desc": "The individual or individuals leading the technical operation of the system."
    },
    {
     "id": "system-poc-other",
     "title": "General Point of Contact (POC)",
     "desc": "A general point of contact for the system, designated by the system owner."
    },
    {
     "id": "information-system-security-officer",
     "title": "System Information System Security Officer (or Equivalent)",
     "desc": "The individual accountable for the security posture of the system on behalf of the system owner."
    },
    {
     "id": "privacy-poc",
     "title": "Privacy Official's Point of Contact",
     "desc": "The individual responsible for the privacy threshold analysis and if necessary the privacy impact assessment."
    },
    {
     "id": "asset-owner",
     "title": "Owner of an inventory item within the system."
    },
    {
     "id": "asset-administrator",
     "title": "Administrative responsibility an inventory item within the system."
    },
    {
     "id": "isa-poc-local",
     "title": "ICA POC (Local)",
     "desc": "The point of contact for an interconnection on behalf of this system.",
     "remarks": "Remove this role if there are no ICAs."
    },
    {
     "id": "isa-poc-remote",
     "title": "ICA POC (Remote)",
     "desc": "The point of contact for an interconnection on behalf of this external system to which this system connects.",
     "remarks": "Remove this role if there are no ICAs."
    },
    {
     "id": "isa-authorizing-official-local",
     "title": "ICA Signatory (Local)",
     "desc": "Responsible for signing an interconnection security agreement on behalf of this system.",
     "remarks": "Remove this role if there are no ICAs."
    },
    {
     "id": "isa-authorizing-official-remote",
     "title": "ICA Signatory (Remote)",
     "desc": "Responsible for signing an interconnection security agreement on behalf of the external system to which this system connects.",
     "remarks": "Remove this role if there are no ICAs."
    },
    {
     "id": "consultant",
     "title": "Consultant",
     "desc": "Any consultants involved with developing or maintaining this content."
    },
    {
     "id": "admin-unix",
     "title": "[SAMPLE]Unix Administrator",
     "desc": "This is a sample role."
    },
    {
     "id": "admin-client",
     "title": "[SAMPLE]Client Administrator",
     "desc": "This is a sample role."
    },
    {
     "id": "program-director",
     "title": "[SAMPLE]Program Director",
     "desc": "This is a sample role."
    },
    {
     "id": "fedramp-pmo",
     "title": "Federal Risk and Authorization Management Program (FedRAMP) Program Management Office (PMO)",
     "short-name": "FedRAMP PMO"
    },
    {
     "id": "fedramp-jab",
     "title": "Federal Risk and Authorization Management Program (FedRAMP) Joint Authorization Board (JAB)",
     "short-name": "FedRAMP JAB"
    }
   ],
   "locations": [
    {
     "uuid": "27b78960-59ef-4619-82b0-ae20b9c709ac",
     "title": "CSP HQ",
     "address": {
      "type": "work",
      "postal-address": [
       "Suite 0000",
       "1234 Some Street"
      ],
      "city": "Haven",
      "state": "ME",
      "postal-code": "00000"
     },
     "remarks": "There must be one location identifying the CSP's primary business address, such as the CSP's HQ, or the address of the system owner's primary business location."
    },
    {
     "uuid": "16adcc8d-65d8-4583-80d3-9cf007744fec",
     "title": "Primary Data Center",
     "address": {
      "postal-address": [
       "2222 Main Street"
      ],
      "city": "Anywhere",
      "state": "--",
      "postal-code": "00000-0000"
     },
     "properties": [
      {
       "name": "conformity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "data-center"
      },
      {
       "name": "conformity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "primary-data-center"
      }
     ],
     "remarks": "There must be one location for each data center.\\n\\nThere must be at least two data centers.\\n\\nFor a data center, briefly summarize the components at this location.\\n\\nAll data centers must have a conformity tag of \\\"data-center\\\".\\n\\nA primary data center must also have a conformity tag of \\\"primary-data-center\\\"."
    },
    {
     "uuid": "ad321514-7b9f-4374-8409-efb18eea6e5d",
     "title": "Secondary Data Center",
     "address": {
      "postal-address": [
       "3333 Small Road"
      ],
      "city": "Anywhere",
      "state": "--",
      "postal-code": "00000-0000"
     },
     "properties": [
      {
       "name": "conformity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "data-center"
      },
      {
       "name": "conformity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "alternate-data-center"
      }
     ],
     "remarks": "There must be one location for each data center.\\n\\nThere must be at least two data centers.\\n\\nFor a data center, briefly summarize the components at this location.\\n\\nAll data centers must have a conformity tag of \\\"data-center\\\"\\n\\nAn alternate or backup data center must also have a conformity tag of \\\"alternate-data-center\\\"."
    }
   ],
   "parties": [
    {
     "uuid": "6b286b5d-8f07-4fa7-8847-1dd0d88f73fb",
     "type": "organization",
     "party-name": "Cloud Service Provider (CSP) Name",
     "short-name": "CSP Acronym/Short Name",
     "location-uuids": [
      "27b78960-59ef-4619-82b0-ae20b9c709ac"
     ],
     "remarks": "Replace sample CSP information."
    },
    {
     "uuid": "77e0e2c8-2560-4fe9-ac78-c3ff4ffc9f6d",
     "type": "organization",
     "party-name": "Federal Risk and Authorization Management Program: Program Management Office",
     "short-name": "FedRAMP PMO",
     "links": [
      {
       "href": "https://fedramp.gov",
       "text": ""
      }
     ],
     "addresses": [
      {
       "type": "work",
       "postal-address": [
        "1800 F St. NW",
        ""
       ],
       "city": "Washington",
       "state": "DC",
       "postal-code": "",
       "country": "US"
      }
     ],
     "email-addresses": [
      "info@fedramp.gov"
     ],
     "remarks": "This party entry must be present in a FedRAMP SSP.\\n\\nThe uuid may be different; however, the uuid must be associated with the \\\"fedramp-pmo\\\" role in the responsible-party assemblies."
    },
    {
     "uuid": "49017ec3-9f51-4dbd-9253-858c2b1295fd",
     "type": "organization",
     "party-name": "Federal Risk and Authorization Management Program: Joint Authorization Board",
     "short-name": "FedRAMP JAB",
     "remarks": "This party entry must be present in a FedRAMP SSP.\\n\\nThe uuid may be different; however, the uuid must be associated with the \\\"fedramp-jab\\\" role in the responsible-party assemblies."
    },
    {
     "uuid": "78992555-4a99-4eaa-868c-f2c249679dd3",
     "type": "organization",
     "party-name": "External Organization",
     "short-name": "External",
     "remarks": "Generic placeholder for any external organization."
    },
    {
     "uuid": "f595397b-cbe4-4a87-8c86-9bff91c4e7fd",
     "type": "organization",
     "party-name": "Agency Name",
     "short-name": "A.N.",
     "remarks": "Generic placeholder for an authorizing agency."
    },
    {
     "uuid": "8e3d39da-4851-4d2a-adb5-4b5585ded952",
     "type": "organization",
     "party-name": "Name of Consulting Org",
     "short-name": "NOCO",
     "links": [
      {
       "href": "https://consulting.sample",
       "text": ""
      }
     ],
     "addresses": [
      {
       "type": "work",
       "postal-address": [
        "3333 Corporate Way"
       ],
       "city": "Washington",
       "state": "DC",
       "postal-code": "",
       "country": "US"
      }
     ],
     "email-addresses": [
      "poc@consulting.sample"
     ]
    },
    {
     "uuid": "80361ec4-bfce-4b5c-85c8-313d6ebd220b",
     "type": "organization",
     "party-name": "[SAMPLE]Remote System Org Name"
    },
    {
     "uuid": "09ad840f-aa79-43aa-9f22-25182c2ab11b",
     "type": "person",
     "party-name": "[SAMPLE]ICA POC's Name",
     "properties": [
      {
       "name": "title",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Individual's Title"
      }
     ],
     "email-addresses": [
      "person@ica.org.example"
     ],
     "telephone-numbers": [
      {
       "number": "202-555-1212"
      }
     ],
     "member-of-organizations": [
      "80361ec4-bfce-4b5c-85c8-313d6ebd220b"
     ]
    },
    {
     "uuid": "f0bc13a4-3303-47dd-80d3-380e159c8362",
     "type": "organization",
     "party-name": "[SAMPLE]Example IaaS Provider",
     "short-name": "E.I.P.",
     "remarks": "Underlying service provider. Leveraged Authorization."
    },
    {
     "uuid": "3360e343-9860-4bda-9dfc-ff427c3dfab6",
     "type": "person",
     "party-name": "[SAMPLE]Person Name 1",
     "properties": [
      {
       "name": "title",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Individual's Title"
      }
     ],
     "addresses": [
      {
       "postal-address": [
        "Mailstop A-1"
       ]
      }
     ],
     "email-addresses": [
      "name@org.domain"
     ],
     "telephone-numbers": [
      {
       "number": "202-000-0001"
      }
     ],
     "member-of-organizations": [
      "6b286b5d-8f07-4fa7-8847-1dd0d88f73fb"
     ],
     "location-uuids": [
      "27b78960-59ef-4619-82b0-ae20b9c709ac"
     ]
    },
    {
     "uuid": "36b8d6c0-3b25-42cc-b529-cf4066145cdd",
     "type": "person",
     "party-name": "[SAMPLE]Person Name 2",
     "properties": [
      {
       "name": "title",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Individual's Title"
      }
     ],
     "addresses": [
      {
       "type": "work",
       "postal-address": [
        "Address Line"
       ],
       "city": "City",
       "state": "ST",
       "postal-code": "00000",
       "country": "US"
      }
     ],
     "email-addresses": [
      "name@org.domain"
     ],
     "telephone-numbers": [
      {
       "number": "202-000-0002"
      }
     ],
     "member-of-organizations": [
      "6b286b5d-8f07-4fa7-8847-1dd0d88f73fb"
     ]
    },
    {
     "uuid": "0cec09d9-20c6-470b-9ffc-85763375880b",
     "type": "person",
     "party-name": "[SAMPLE]Person Name 3",
     "properties": [
      {
       "name": "title",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Individual's Title"
      }
     ],
     "addresses": [
      {
       "type": "work",
       "postal-address": [
        "Address Line"
       ],
       "city": "City",
       "state": "ST",
       "postal-code": "00000",
       "country": "US"
      }
     ],
     "email-addresses": [
      "name@org.domain"
     ],
     "telephone-numbers": [
      {
       "number": "202-000-0003"
      }
     ],
     "member-of-organizations": [
      "6b286b5d-8f07-4fa7-8847-1dd0d88f73fb"
     ]
    },
    {
     "uuid": "f75e21f6-43d8-46ab-890d-7f2eebc5a830",
     "type": "person",
     "party-name": "[SAMPLE]Person Name 4",
     "properties": [
      {
       "name": "title",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Individual's Title"
      }
     ],
     "addresses": [
      {
       "type": "work",
       "postal-address": [
        "Address Line"
       ],
       "city": "City",
       "state": "ST",
       "postal-code": "00000",
       "country": "US"
      }
     ],
     "email-addresses": [
      "name@org.domain"
     ],
     "telephone-numbers": [
      {
       "number": "202-000-0004"
      }
     ],
     "member-of-organizations": [
      "6b286b5d-8f07-4fa7-8847-1dd0d88f73fb"
     ]
    },
    {
     "uuid": "132953a9-640c-46f7-9de9-3fa15ec99361",
     "type": "person",
     "party-name": "[SAMPLE]Person Name 5",
     "properties": [
      {
       "name": "title",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Individual's Title"
      }
     ],
     "addresses": [
      {
       "type": "work",
       "postal-address": [
        "Address Line"
       ],
       "city": "City",
       "state": "ST",
       "postal-code": "00000",
       "country": "US"
      }
     ],
     "email-addresses": [
      "name@org.domain"
     ],
     "telephone-numbers": [
      {
       "number": "202-000-0005"
      }
     ],
     "member-of-organizations": [
      "6b286b5d-8f07-4fa7-8847-1dd0d88f73fb"
     ]
    },
    {
     "uuid": "4fded5fd-7a65-47ea-bd76-df57c46e27d1",
     "type": "person",
     "party-name": "[SAMPLE]Person Name 6",
     "properties": [
      {
       "name": "title",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Individual's Title"
      }
     ],
     "addresses": [
      {
       "type": "work",
       "postal-address": [
        "Address Line"
       ],
       "city": "City",
       "state": "ST",
       "postal-code": "00000",
       "country": "US"
      }
     ],
     "email-addresses": [
      "name@org.domain"
     ],
     "telephone-numbers": [
      {
       "number": "202-000-0006"
      }
     ],
     "member-of-organizations": [
      "78992555-4a99-4eaa-868c-f2c249679dd3"
     ]
    },
    {
     "uuid": "db234cb7-1776-425c-9ac4-b067c1723011",
     "type": "person",
     "party-name": "[SAMPLE]Person Name 7",
     "properties": [
      {
       "name": "title",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Individual's Title"
      }
     ],
     "addresses": [
      {
       "type": "work",
       "postal-address": [
        "Address Line"
       ],
       "city": "City",
       "state": "ST",
       "postal-code": "00000",
       "country": "US"
      }
     ],
     "email-addresses": [
      "name@org.domain"
     ],
     "telephone-numbers": [
      {
       "number": "202-000-0007"
      }
     ],
     "member-of-organizations": [
      "6b286b5d-8f07-4fa7-8847-1dd0d88f73fb"
     ]
    },
    {
     "uuid": "b306f5af-b93a-4a7f-a2b2-37a44fc92a79",
     "type": "organization",
     "party-name": "[SAMPLE] IT Department"
    },
    {
     "uuid": "59cdc953-5902-4fa4-a878-f3163854624c",
     "type": "organization",
     "party-name": "[SAMPLE]Security Team"
    }
   ],
   "responsible-parties": {
    "cloud-service-provider": {
     "party-uuids": [
      "6b286b5d-8f07-4fa7-8847-1dd0d88f73fb"
     ],
     "remarks": "Exactly one"
    },
    "prepared-by": {
     "party-uuids": [
      "3360e343-9860-4bda-9dfc-ff427c3dfab6"
     ],
     "remarks": "Exactly one"
    },
    "prepared-for": {
     "party-uuids": [
      "6b286b5d-8f07-4fa7-8847-1dd0d88f73fb"
     ]
    },
    "content-approver": {
     "party-uuids": [
      "3360e343-9860-4bda-9dfc-ff427c3dfab6",
      "36b8d6c0-3b25-42cc-b529-cf4066145cdd"
     ],
     "remarks": "One or more"
    },
    "system-owner": {
     "party-uuids": [
      "3360e343-9860-4bda-9dfc-ff427c3dfab6"
     ],
     "remarks": "Exactly one"
    },
    "authorizing-official": {
     "party-uuids": [
      "49017ec3-9f51-4dbd-9253-858c2b1295fd",
      "4fded5fd-7a65-47ea-bd76-df57c46e27d1"
     ],
     "remarks": "One or more"
    },
    "system-poc-management": {
     "party-uuids": [
      "0cec09d9-20c6-470b-9ffc-85763375880b"
     ],
     "remarks": "Exactly one"
    },
    "system-poc-technical": {
     "party-uuids": [
      "f75e21f6-43d8-46ab-890d-7f2eebc5a830"
     ],
     "remarks": "Exactly one"
    },
    "information-system-security-officer": {
     "party-uuids": [
      "132953a9-640c-46f7-9de9-3fa15ec99361"
     ],
     "remarks": "Exactly one"
    },
    "authorizing-official-poc": {
     "party-uuids": [
      "4fded5fd-7a65-47ea-bd76-df57c46e27d1"
     ],
     "remarks": "Exactly one"
    },
    "privacy-poc": {
     "party-uuids": [
      "db234cb7-1776-425c-9ac4-b067c1723011"
     ],
     "remarks": "Exactly one"
    },
    "fedramp-pmo": {
     "party-uuids": [
      "77e0e2c8-2560-4fe9-ac78-c3ff4ffc9f6d"
     ],
     "remarks": "Exactly one"
    },
    "fedramp-jab": {
     "party-uuids": [
      "49017ec3-9f51-4dbd-9253-858c2b1295fd"
     ],
     "remarks": "Exactly one"
    }
   },
   "remarks": "This OSCAL-based FedRAMP SSP Template can be used for the FedRAMP Low, Moderate, and\n            High baselines.\\n\\nGuidance for OSCAL-based FedRAMP Tailored content has not yet been developed."
  },
  "import-profile": {
   "href": "#890170c3-d4fa-4d25-ab96-8e4bf7cc237c"
  },
  "system-characteristics": {
   "system-ids": [
    {
     "identifier-type": "https://fedramp.gov",
     "id": "F00000000"
    }
   ],
   "system-name": "System's Full Name",
   "system-name-short": "System's Short Name or Acronym",
   "description": "Describe the purpose and functions of this system here.",
   "properties": [
    {
     "name": "authorization-type",
     "ns": "https://fedramp.gov/ns/oscal",
     "value": "fedramp-agency"
    },
    {
     "name": "security-eauth-level",
     "ns": "https://fedramp.gov/ns/oscal",
     "class": "security-eauth",
     "value": "2"
    },
    {
     "name": "identity-assurance-level",
     "value": "2"
    },
    {
     "name": "authenticator-assurance-level",
     "value": "2"
    },
    {
     "name": "federation-assurance-level",
     "value": "2"
    }
   ],
   "annotations": [
    {
     "name": "cloud-service-model",
     "value": "saas",
     "remarks": "Remarks are required if service model is \\\"other\\\". Optional otherwise."
    },
    {
     "name": "cloud-deployment-model",
     "value": "government-only-cloud",
     "remarks": "Remarks are required if deployment model is \\\"hybrid-cloud\\\" or \\\"other\\\". Optional\n               otherwise."
    }
   ],
   "security-sensitivity-level": "low",
   "system-information": {
    "properties": [
     {
      "name": "privacy-sensitive",
      "value": "yes"
     },
     {
      "name": "pta-1",
      "ns": "https://fedramp.gov/ns/oscal",
      "class": "pta",
      "value": "yes"
     },
     {
      "name": "pta-2",
      "ns": "https://fedramp.gov/ns/oscal",
      "class": "pta",
      "value": "yes"
     },
     {
      "name": "pta-3",
      "ns": "https://fedramp.gov/ns/oscal",
      "class": "pta",
      "value": "yes"
     },
     {
      "name": "pta-4",
      "ns": "https://fedramp.gov/ns/oscal",
      "class": "pta",
      "value": "no"
     },
     {
      "name": "sorn-id",
      "ns": "https://fedramp.gov/ns/oscal",
      "class": "pta",
      "value": "[No SORN ID]"
     }
    ],
    "information-types": [
     {
      "uuid": "06ecba4f-db96-4491-a3a2-7febfa227435",
      "title": "Information Type Name",
      "description": "A description of the information.",
      "information-type-ids": {
       "https://doi.org/10.6028/NIST.SP.800-60v2r1": {
        "id": "C.2.4.1"
       }
      },
      "confidentiality-impact": {
       "base": "fips-199-moderate",
       "selected": "fips-199-moderate",
       "adjustment-justification": "Required if the base and selected values do not match."
      },
      "integrity-impact": {
       "base": "fips-199-moderate",
       "selected": "fips-199-moderate",
       "adjustment-justification": "Required if the base and selected values do not match."
      },
      "availability-impact": {
       "base": "fips-199-moderate",
       "selected": "fips-199-moderate",
       "adjustment-justification": "Required if the base and selected values do not match."
      }
     }
    ]
   },
   "security-impact-level": {
    "security-objective-confidentiality": "fips-199-moderate",
    "security-objective-integrity": "fips-199-moderate",
    "security-objective-availability": "fips-199-moderate"
   },
   "status": {
    "state": "operational",
    "remarks": "Remarks are required if status/state is \\\"other\\\". Optional otherwise."
   },
   "authorization-boundary": {
    "description": "A holistic, top-level explanation of the FedRAMP authorization boundary.",
    "diagrams": {
     "dbf46c27-52a9-49c4-beb6-b6399cd75497": {
      "description": "A diagram-specific explanation.",
      "links": [
       {
        "href": "#d2eb3c18-6754-4e3a-a933-03d289e3fad5",
        "rel": "diagram",
        "text": ""
       }
      ],
      "caption": "Authorization Boundary Diagram"
     }
    }
   },
   "network-architecture": {
    "description": "A holistic, top-level explanation of the network architecture.",
    "diagrams": {
     "e97c3395-433a-48c1-8cc7-dd1e1555941c": {
      "description": "A diagram-specific explanation.",
      "links": [
       {
        "href": "#61081e81-850b-43c1-bf43-1ecbddcb9e7f",
        "rel": "diagram",
        "text": ""
       }
      ],
      "caption": "Network Diagram"
     }
    }
   },
   "data-flow": {
    "description": "A holistic, top-level explanation of the system's data flows.",
    "diagrams": {
     "e3b98448-4219-46a5-b229-412423c566f3": {
      "description": "A diagram-specific explanation.",
      "links": [
       {
        "href": "#ac5d7535-f3b8-45d3-bf3b-735c82c64547",
        "rel": "diagram",
        "text": ""
       }
      ],
      "caption": "Data Flow Diagram"
     }
    }
   }
  },
  "system-implementation": {
   "properties": [
    {
     "name": "users-internal",
     "ns": "https://fedramp.gov/ns/oscal",
     "value": "0"
    },
    {
     "name": "users-external",
     "ns": "https://fedramp.gov/ns/oscal",
     "value": "0"
    },
    {
     "name": "users-internal-future",
     "ns": "https://fedramp.gov/ns/oscal",
     "value": "0"
    },
    {
     "name": "users-external-future",
     "ns": "https://fedramp.gov/ns/oscal",
     "value": "0"
    }
   ],
   "leveraged-authorizations": [
    {
     "uuid": "5a9c98ab-8e5e-433d-a7bd-515c07cd1497",
     "title": "Name of Underlying System",
     "party-uuid": "f0bc13a4-3303-47dd-80d3-380e159c8362",
     "date-authorized": "2015-01-01",
     "remarks": "The leveraged-authorizaton assembly is supposed to have a required uuid flag instead of an optional id flag. This will be fixed in the syntax shortly.\\n\\nUse one leveraged-authorization assembly for each underlying system. (In the legacy world, these may be general support systems."
    }
   ],
   "users": {
    "9cb0fab0-78bd-44ba-bcb8-3e9801cc952f": {
     "title": "[SAMPLE]Unix System Administrator",
     "properties": [
      {
       "name": "sensitivity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "high"
      }
     ],
     "annotations": [
      {
       "name": "privilege-level",
       "value": "privileged"
      },
      {
       "name": "type",
       "value": "internal"
      }
     ],
     "role-ids": [
      "admin-unix"
     ],
     "authorized-privileges": [
      {
       "title": "Full administrative access (root)",
       "functions-performed": [
        "Add/remove users and hardware",
        "install and configure software",
        "OS updates, patches and hotfixes",
        "perform backups"
       ]
      }
     ]
    },
    "16ec71e7-025c-43e4-9d3f-3acb485fac2e": {
     "title": "[SAMPLE]Client Administrator",
     "properties": [
      {
       "name": "sensitivity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "moderate"
      }
     ],
     "annotations": [
      {
       "name": "privilege-level",
       "value": "non-privileged"
      },
      {
       "name": "type",
       "value": "external"
      }
     ],
     "role-ids": [
      "external"
     ],
     "authorized-privileges": [
      {
       "title": "Portal administration",
       "functions-performed": [
        "Add/remove client users",
        "Create, modify and delete client applications"
       ]
      }
     ]
    },
    "ba7708c1-4041-48ab-9b7b-1ddb5e175fe0": {
     "title": "[SAMPLE]Program Director",
     "properties": [
      {
       "name": "sensitivity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "limited"
      }
     ],
     "annotations": [
      {
       "name": "privilege-level",
       "value": "no-logical-access"
      },
      {
       "name": "type",
       "value": "internal"
      }
     ],
     "role-ids": [
      "program-director"
     ],
     "authorized-privileges": [
      {
       "title": "Administrative Access Approver",
       "functions-performed": [
        "Approves access requests for administrative accounts."
       ]
      },
      {
       "title": "Access Approver",
       "functions-performed": [
        "Approves access requests for administrative accounts."
       ]
      }
     ]
    }
   },
   "components": {
    "60f92bcf-f353-4236-9803-2a5d417555f4": {
     "component-type": "system",
     "title": "This System",
     "description": "The entire system as depicted in the system authorization boundary",
     "status": {
      "state": "operational"
     }
    },
    "e82e6e07-0c62-417e-8a19-3744991b4c65": {
     "component-type": "system",
     "title": "Name of Leveraged System",
     "description": "If the leveraged system owner provides a UUID for their system (such as in an OSCAL-based CRM), it should be used as the UUID for this component.",
     "properties": [
      {
       "name": "leveraged-authorization-uuid",
       "value": "5a9c98ab-8e5e-433d-a7bd-515c07cd1497"
      }
     ],
     "status": {
      "state": "operational"
     }
    },
    "95beec7e-6f82-4aaa-8211-969cd7c1f1ab": {
     "component-type": "validation",
     "title": "[SAMPLE]Module Name",
     "description": "[SAMPLE]FIPS 140-2 Validated Module",
     "properties": [
      {
       "name": "cert-no",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "0000"
      }
     ],
     "links": [
      {
       "href": "https://csrc.nist.gov/projects/cryptographic-module-validation-program/Certificate/0000",
       "text": ""
      }
     ],
     "status": {
      "state": "operational"
     }
    },
    "05ceb8df-52e7-49db-9719-891723f366bd": {
     "component-type": "software",
     "title": "[SAMPLE]Product Name",
     "description": "FUNCTION: Describe typical component function.",
     "properties": [
      {
       "name": "asset-type",
       "value": "os"
      },
      {
       "name": "scan-type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "infrastructure"
      },
      {
       "name": "vendor-name",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Vendor Name"
      },
      {
       "name": "model",
       "value": "Model Number"
      },
      {
       "name": "version",
       "value": "Version Number"
      },
      {
       "name": "patch-level",
       "value": "Patch Level"
      },
      {
       "name": "validation",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "fips-module-1"
      }
     ],
     "status": {
      "state": "operational"
     },
     "responsible-roles": {
      "admin-unix": {
       "party-uuids": [
        "3360e343-9860-4bda-9dfc-ff427c3dfab6"
       ]
      }
     },
     "remarks": "COMMENTS: Provide other comments as needed."
    },
    "1541015b-6d19-42cb-a991-624cc082ed4d": {
     "component-type": "hardware",
     "title": "[SAMPLE]Product",
     "description": "FUNCTION: Describe typical component function.",
     "properties": [
      {
       "name": "asset-type",
       "value": "database"
      },
      {
       "name": "scan-type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "infrastructure"
      },
      {
       "name": "scan-type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "database"
      },
      {
       "name": "vendor-name",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Vendor Name"
      },
      {
       "name": "model",
       "value": "Model Number"
      },
      {
       "name": "version",
       "value": "Version Number"
      }
     ],
     "status": {
      "state": "operational"
     },
     "responsible-roles": {
      "asset-administrator": {
       "party-uuids": [
        "b306f5af-b93a-4a7f-a2b2-37a44fc92a79"
       ]
      },
      "asset-owner": {
       "party-uuids": [
        "36b8d6c0-3b25-42cc-b529-cf4066145cdd"
       ]
      }
     },
     "remarks": "COMMENTS: Provide other comments as needed."
    },
    "6617f60b-8bac-422d-9939-94f43ddc0f7a": {
     "component-type": "os",
     "title": "OS Sample",
     "description": "None",
     "properties": [
      {
       "name": "asset-type",
       "value": "os"
      },
      {
       "name": "scan-type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "infrastructure"
      }
     ],
     "annotations": [
      {
       "name": "baseline-configuration-name",
       "value": "Baseline Config. Name"
      },
      {
       "name": "allows-authenticated-scan",
       "value": "yes"
      }
     ],
     "status": {
      "state": "operational"
     }
    },
    "120f1404-7c9f-4856-a247-63bd89d9e769": {
     "component-type": "software",
     "title": "Database Sample",
     "description": "None",
     "properties": [
      {
       "name": "asset-type",
       "value": "database"
      },
      {
       "name": "scan-type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "database"
      }
     ],
     "annotations": [
      {
       "name": "baseline-configuration-name",
       "value": "Baseline Config. Name"
      },
      {
       "name": "allows-authenticated-scan",
       "value": "yes"
      }
     ],
     "status": {
      "state": "operational"
     }
    },
    "8f230d84-2f9b-44a3-acdb-019566ab2554": {
     "component-type": "software",
     "title": "Appliance Sample",
     "description": "None",
     "properties": [
      {
       "name": "asset-type",
       "value": "appliance"
      },
      {
       "name": "scan-type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "web"
      },
      {
       "name": "login-url",
       "value": "https://admin.offering.com/login"
      }
     ],
     "annotations": [
      {
       "name": "baseline-configuration-name",
       "value": "Baseline Config. Name"
      },
      {
       "name": "allows-authenticated-scan",
       "value": "no",
       "remarks": "Vendor appliance. No admin-level access."
      }
     ],
     "status": {
      "state": "operational"
     }
    },
    "d5841417-de4c-4d84-ab3c-39dd1fd32a96": {
     "component-type": "service",
     "title": "[SAMPLE]Service Name",
     "description": "Describe the service",
     "purpose": "Describe the reason the service is needed.",
     "properties": [
      {
       "name": "used-by",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "What uses this service?"
      },
      {
       "name": "protocol",
       "value": ""
      }
     ],
     "status": {
      "state": "operational"
     },
     "protocols": [
      {
       "name": "http",
       "port-ranges": [
        {
         "start": 80,
         "end": 80,
         "transport": "TCP"
        }
       ]
      },
      {
       "name": "https",
       "port-ranges": [
        {
         "start": 443,
         "end": 443,
         "transport": "TCP"
        }
       ]
      }
     ],
     "remarks": "Section 10.2, Table 10-1. Ports, Protocols and Services\\n\\n**SERVICES ARE NOW COMPONENTS WITH type='service'**"
    },
    "2812ef51-61e7-4505-afbb-da5a073a2a5b": {
     "component-type": "interconnection",
     "title": "[EXAMPLE]Authorized Connection Information System Name",
     "description": "Briefly describe the interconnection.",
     "properties": [
      {
       "name": "service-processor",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "[SAMPLE]Telco Name"
      },
      {
       "name": "ipv4-address",
       "ns": "https://fedramp.gov/ns/oscal",
       "class": "local",
       "value": "10.1.1.1"
      },
      {
       "name": "ipv4-address",
       "ns": "https://fedramp.gov/ns/oscal",
       "class": "remote",
       "value": "10.2.2.2"
      },
      {
       "name": "direction",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "incoming-outgoing"
      },
      {
       "name": "information",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Describe the information being transmitted."
      },
      {
       "name": "port",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "80"
      },
      {
       "name": "circuit",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "1"
      }
     ],
     "annotations": [
      {
       "name": "connection-security",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "ipsec",
       "remarks": "If \\\"other\\\", remarks are required. Optional otherwise."
      }
     ],
     "links": [
      {
       "href": "#9d6cf2b4-8e88-4040-a33c-7bc206553a1a",
       "rel": "agreement",
       "text": ""
      }
     ],
     "status": {
      "state": "operational"
     },
     "responsible-roles": {
      "isa-poc-remote": {
       "party-uuids": [
        "09ad840f-aa79-43aa-9f22-25182c2ab11b"
       ]
      },
      "isa-poc-local": {
       "party-uuids": [
        "09ad840f-aa79-43aa-9f22-25182c2ab11b"
       ]
      },
      "isa-authorizing-official-remote": {
       "party-uuids": [
        "09ad840f-aa79-43aa-9f22-25182c2ab11b"
       ]
      },
      "isa-authorizing-official-local": {
       "party-uuids": [
        "09ad840f-aa79-43aa-9f22-25182c2ab11b"
       ]
      }
     },
     "remarks": "Optional notes about this interconnection"
    }
   },
   "system-inventory": {
    "inventory-items": {
     "98e37f90-fbb5-4177-badb-9b55229cc183": {
      "asset-id": "unique-asset-id",
      "description": "Flat-File Example (No implemented-component).",
      "properties": [
       {
        "name": "ipv4-address",
        "value": "10.1.1.1"
       },
       {
        "name": "ipv6-address",
        "value": "0000:0000:0000:0000"
       },
       {
        "name": "virtual",
        "value": "no"
       },
       {
        "name": "public",
        "value": "no"
       },
       {
        "name": "fqdn",
        "value": "dns.name"
       },
       {
        "name": "uri",
        "value": "uniform.resource.identifier"
       },
       {
        "name": "netbios-name",
        "value": "netbios-name"
       },
       {
        "name": "mac-address",
        "value": "00:00:00:00:00:00"
       },
       {
        "name": "software-name",
        "value": "software-name"
       },
       {
        "name": "version",
        "value": "V 0.0.0"
       },
       {
        "name": "asset-type",
        "value": "os"
       },
       {
        "name": "vendor-name",
        "ns": "https://fedramp.gov/ns/oscal",
        "value": "Vendor Name"
       },
       {
        "name": "model",
        "value": "Model Number"
       },
       {
        "name": "patch-level",
        "value": "Patch-Level"
       },
       {
        "name": "serial-number",
        "value": "Serial #"
       },
       {
        "name": "asset-tag",
        "value": "Asset Tag"
       },
       {
        "name": "vlan-id",
        "value": "VLAN Identifier"
       },
       {
        "name": "network-id",
        "value": "Network Identifier"
       },
       {
        "name": "scan-type",
        "ns": "https://fedramp.gov/ns/oscal",
        "value": "infrastructure"
       },
       {
        "name": "scan-type",
        "ns": "https://fedramp.gov/ns/oscal",
        "value": "database"
       },
       {
        "name": "validation",
        "ns": "https://fedramp.gov/ns/oscal",
        "value": "component-id"
       }
      ],
      "annotations": [
       {
        "name": "allows-authenticated-scan",
        "value": "no",
        "remarks": "If no, explain why. If yes, omit remarks field."
       },
       {
        "name": "baseline-configuration-name",
        "value": "Baseline Config. Name"
       },
       {
        "name": "physical-location",
        "value": "Physical location of Asset"
       },
       {
        "name": "is-scanned",
        "value": "yes",
        "remarks": "If no, explain why. If yes, omit remarks field."
       },
       {
        "name": "function",
        "value": "Required brief, text-based description.",
        "remarks": "Optional, longer, formatted description."
       }
      ],
      "responsible-parties": {
       "asset-owner": {
        "party-uuids": [
         "db234cb7-1776-425c-9ac4-b067c1723011"
        ]
       },
       "asset-administrator": {
        "party-uuids": [
         "b306f5af-b93a-4a7f-a2b2-37a44fc92a79"
        ]
       }
      },
      "remarks": "COMMENTS: Additional information about this item."
     },
     "c916d3c5-229e-4786-bf3f-4d71baa0e7a5": {
      "asset-id": "unique-asset-ID",
      "description": "Component Inventory Example",
      "properties": [
       {
        "name": "ipv4-address",
        "value": "10.2.2.2"
       },
       {
        "name": "ipv6-address",
        "value": "0000:0000:0000:0000"
       },
       {
        "name": "mac-address",
        "value": "00:00:00:00:00:00"
       },
       {
        "name": "virtual",
        "value": "no"
       },
       {
        "name": "public",
        "value": "no"
       },
       {
        "name": "fqdn",
        "value": "dns.name"
       },
       {
        "name": "uri",
        "value": "uniform.resource.locator"
       },
       {
        "name": "netbios-name",
        "value": "netbios-name"
       },
       {
        "name": "patch-level",
        "value": "Patch-Level"
       }
      ],
      "annotations": [
       {
        "name": "baseline-configuration-name",
        "value": "Baseline Configuration Name"
       },
       {
        "name": "physical-location",
        "value": "Physical location of Asset"
       },
       {
        "name": "scan-authenticated",
        "ns": "https://fedramp.gov/ns/oscal",
        "value": "no",
        "remarks": "If no, explain why. If yes, omit remark."
       },
       {
        "name": "scan-latest",
        "ns": "https://fedramp.gov/ns/oscal",
        "value": "yes",
        "remarks": "If no, explain why. If yes, omit remark."
       }
      ],
      "responsible-parties": {
       "asset-owner": {
        "party-uuids": [
         "3360e343-9860-4bda-9dfc-ff427c3dfab6"
        ]
       },
       "asset-administrator": {
        "party-uuids": [
         "b306f5af-b93a-4a7f-a2b2-37a44fc92a79"
        ]
       }
      },
      "implemented-components": {
       "05ceb8df-52e7-49db-9719-891723f366bd": {}
      },
      "remarks": "COMMENTS: If needed, provide additional information about this inventory item."
     },
     "37c00d5a-ccf2-4112-a0ee-8460be8cff40": {
      "asset-id": "unique-asset-id",
      "description": "None.",
      "properties": [
       {
        "name": "ipv4-address",
        "value": "10.3.3.3"
       }
      ],
      "annotations": [
       {
        "name": "is-scanned",
        "value": "yes"
       }
      ],
      "implemented-components": {
       "1541015b-6d19-42cb-a991-624cc082ed4d": {}
      }
     },
     "fb7a84fb-7e30-4f5b-9997-2ecd4d270bdd": {
      "asset-id": "unique-asset-id",
      "description": "None.",
      "properties": [
       {
        "name": "ipv4-address",
        "value": "10.4.4.4"
       }
      ],
      "annotations": [
       {
        "name": "is-scanned",
        "value": "yes"
       }
      ],
      "implemented-components": {
       "05ceb8df-52e7-49db-9719-891723f366bd": {}
      }
     },
     "779d4e89-bba6-432c-b50d-d699fe534129": {
      "asset-id": "unique-asset-id",
      "description": "None.",
      "properties": [
       {
        "name": "ipv4-address",
        "value": "10.5.5.5"
       }
      ],
      "annotations": [
       {
        "name": "is-scanned",
        "value": "yes"
       }
      ],
      "implemented-components": {
       "8f230d84-2f9b-44a3-acdb-019566ab2554": {}
      }
     },
     "20b207d5-5e77-4501-b02d-5d2a6e88db85": {
      "asset-id": "unique-asset-id",
      "description": "None.",
      "properties": [
       {
        "name": "ipv4-address",
        "value": "10.6.6.6"
       }
      ],
      "annotations": [
       {
        "name": "is-scanned",
        "value": "no",
        "remarks": "Asset wasn't running at time of scan."
       }
      ],
      "implemented-components": {
       "05ceb8df-52e7-49db-9719-891723f366bd": {}
      }
     },
     "79b4f0d1-91ab-49e8-af28-045c12aa9272": {
      "asset-id": "unique-asset-id",
      "description": "None.",
      "properties": [
       {
        "name": "ipv4-address",
        "value": "10.7.7.7"
       }
      ],
      "annotations": [
       {
        "name": "is-scanned",
        "value": "yes"
       }
      ],
      "implemented-components": {
       "1541015b-6d19-42cb-a991-624cc082ed4d": {}
      }
     },
     "b31b360d-b58b-4c7c-b344-68e17238d858": {
      "asset-id": "unique-asset-id",
      "description": "None.",
      "properties": [
       {
        "name": "ipv4-address",
        "value": "10.8.8.8"
       }
      ],
      "annotations": [
       {
        "name": "is-scanned",
        "value": "no",
        "remarks": "Asset wasn't running at time of scan."
       }
      ],
      "implemented-components": {
       "05ceb8df-52e7-49db-9719-891723f366bd": {}
      }
     },
     "55b55b3d-3bd9-409a-bc87-3b9a2074bacd": {
      "asset-id": "10.10.10.0",
      "description": "IPv4 Production Subnet.",
      "properties": [
       {
        "name": "ipv4-subnet",
        "value": "10.10.10.0/24"
       }
      ],
      "annotations": [
       {
        "name": "is-scanned",
        "value": "yes"
       }
      ]
     },
     "c0dbefa1-c8e8-4ca8-bd73-67cb7b1fa3f6": {
      "asset-id": "10.10.20.0",
      "description": "IPv4 Management Subnet.",
      "properties": [
       {
        "name": "ipv4-subnet",
        "value": "10.10.20.0/24"
       }
      ],
      "annotations": [
       {
        "name": "is-scanned",
        "value": "yes"
       }
      ]
     }
    }
   }
  },
  "control-implementation": {
   "description": "FedRAMP SSP Template Section 13\\n\\nThis description field is required by OSCAL. FedRAMP does not require any specific\n            information here.",
   "implemented-requirements": [
    {
     "uuid": "eee8697a-bc39-45aa-accc-d3e534932efb",
     "control-id": "ac-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "parameter-settings": {
      "ac-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "ac-1_prm_2": {
       "value": "[specify frequency]"
      },
      "ac-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "ac-1_stmt.a": {
       "uuid": "fb4d039a-dc4f-46f5-9c1f-f6343eaf69bc",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "3f5612a4-cd1d-4c47-8cae-75d2eaa332cd",
         "description": "Describe how Part a is satisfied within the system."
        }
       },
       "remarks": "The specified component is the system itself.\\n\\nAny control implementation response that can not be associated with another component is associated with the component representing the system."
      },
      "ac-1_stmt.a.1": {
       "uuid": "0afdccce-b5ed-4127-ae19-cfbdd17d775e",
       "links": [
        {
         "href": "#090ab379-2089-4830-b9fd-26d0729e22e9",
         "rel": "policy",
         "text": ""
        }
       ],
       "remarks": "This identifies a policy (attached in resources) that satisfies this control."
      },
      "ac-1_stmt.a.2": {
       "uuid": "ffaf5e02-3055-40df-bbeb-3b94e834a43f",
       "links": [
        {
         "href": "#att-process-1",
         "rel": "process",
         "text": ""
        }
       ],
       "remarks": "This identifies a process (attached in resources) that satisfies this control."
      },
      "ac-1_stmt.b.1": {
       "uuid": "b46f97ec-55c1-4249-a9b9-3a228f1e3791",
       "description": "Describe how Part b-1 is satisfied."
      },
      "ac-1_stmt.b.2": {
       "uuid": "59c67969-3d5c-45f1-8e3e-1e642249633f",
       "description": "Describe how Part b-2 is satisfied."
      }
     }
    },
    {
     "uuid": "7a36cf53-156d-4d1f-9a8b-433f61cc57b7",
     "control-id": "ac-2",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Completion Date"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "partial",
       "remarks": "Describe the portion of the control that is not satisfied."
      },
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "not-applicable",
       "remarks": "Describe the justification for marking this control Not Applicable."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "customer-configured",
       "remarks": "Describe any customer-configured requirements for satisfying this control."
      }
     ],
     "responsible-roles": {
      "admin-unix": {},
      "program-director": {}
     },
     "parameter-settings": {
      "ac-2_prm_1": {
       "value": "[SAMPLE]privileged, non-privileged"
      },
      "ac-2_prm_2": {
       "value": "[SAMPLE]all"
      },
      "ac-2_prm_3": {
       "value": "[SAMPLE]The Access Control Procedure"
      },
      "ac-2_prm_4": {
       "value": "[SAMPLE]annually"
      }
     },
     "statements": {
      "ac-2_stmt.a": {
       "uuid": "24a85abb-25ad-4686-850c-5c0e8ab69a0c",
       "description": "Do not respond to this statement here. Respond within the `by-component` assembly below.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "8a72663c-28c7-41c2-8739-f1ee2d5761ac",
         "description": "For the portion of the control satisfied by this system or its owning organization, describe\n                        **how** the control is met.",
         "annotations": [
          {
           "name": "responsibility",
           "value": "customer",
           "remarks": "General customer responsibility description."
          }
         ],
         "remarks": "The component-uuid above points to the \\\"this system\\\" component.\\n\\nAny control response content that does not cleanly fit another system component is placed here. This includes customer responsibility content.\\n\\nThis can also be used to provide a summary, such as a holistic overview of how multiple components work together.\\n\\nWhile the \\\"this system\\\" component is not expclicity required within every `statement`, it will typically be present."
        },
        "b7364f67-bf65-4df2-b756-4b9c6b1c4a52": {
         "uuid": "84de735f-ba37-4bb4-b784-79760f986a40",
         "description": "For the portion inherited from an underlying FedRAMP-authorized provider,\n                     describe **what** is inherited.",
         "annotations": [
          {
           "name": "responsibility",
           "value": "customer",
           "remarks": "Component-specific customer responsibility description."
          }
         ]
        },
        "cae07d12-8566-443a-95de-7596b9cac953": {
         "uuid": "13db02bb-1f33-4f79-8711-ed47c2c3d337",
         "description": "For the portion of the control that must be configured by or provided by the\n                     customer, describe the customer responsibility here. This is what will appear\n                     in the Customer Responsibility Matrix."
        }
       }
      }
     }
    },
    {
     "uuid": "c332a6f8-bbe6-4ee9-aaea-d89d251c68df",
     "control-id": "at-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "at-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "at-1_prm_2": {
       "value": "[specify frequency]"
      },
      "at-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "at-1_stmt.a": {
       "uuid": "ee5a11fb-9bae-4680-8f8c-575c85d47355",
       "description": "Component-based Approach",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "d3bdee1c-7d84-4ed4-8950-e13256edb7fa",
         "description": "Describe how Part a is satisfied."
        }
       }
      },
      "at-1_stmt.a.1": {
       "uuid": "2e8ec7ce-c9c6-4f5f-9d50-3a3b9d3acf65",
       "links": [
        {
         "href": "#090ab379-2089-4830-b9fd-26d0729e22e9",
         "rel": "policy",
         "text": ""
        }
       ],
       "remarks": "This identifies a policy (attached in resources) that satisfies this control."
      },
      "at-1_stmt.a.2": {
       "uuid": "e7f9b618-c092-4b8b-b416-0ee477026726",
       "links": [
        {
         "href": "#att-process-1",
         "rel": "process",
         "text": ""
        }
       ],
       "remarks": "This identifies a process (attached in resources) that satisfies this control."
      },
      "at-1_stmt.b.1": {
       "uuid": "29192f0b-edb1-4820-b951-65ffdc64bb3e",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "5a5e5c3e-1108-47f1-a83f-05e0394219db",
         "description": "Describe how Part b-1 is satisfied."
        }
       }
      },
      "at-1_stmt.b.2": {
       "uuid": "23a9bfa7-6e3f-4e00-a120-791b26a9157e",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "fcc63699-04ab-4b69-b7b9-a13bee6685b3",
         "description": "Describe how Part b-2 is satisfied."
        }
       }
      }
     }
    },
    {
     "uuid": "381c8d0c-e6ec-41a9-9b16-01657226c70f",
     "control-id": "au-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "au-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "au-1_prm_2": {
       "value": "[specify frequency]"
      },
      "au-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "au-1_stmt.a": {
       "uuid": "9a2bd937-226e-4aaf-8261-2cf0c2e3aa10",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "30042cb9-ff85-472f-b769-68bd7bb5bbd9",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "au-1_stmt.b.1": {
       "uuid": "d01f186f-a14f-4e22-b069-84a55e48a112",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "f41962c7-b53b-46f8-a84f-4aba25904bb8",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "au-1_stmt.b.2": {
       "uuid": "ea153acb-2bd0-41d9-8ebd-ba022d31230a",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "9ad59f0d-17a2-4f3f-af6a-a8529d692195",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    },
    {
     "uuid": "43e388d9-3854-44f6-8c6f-17a6d51ee6a2",
     "control-id": "ca-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "ca-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "ca-1_prm_2": {
       "value": "[specify frequency]"
      },
      "ca-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "ca-1_stmt.a": {
       "uuid": "e7bd0a7e-5f92-4769-8cd3-76ad2f663a5c",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "e5815f1d-ec94-4d98-8896-ec57e339bd7b",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "ca-1_stmt.b.1": {
       "uuid": "b2c3ec86-b976-4e5a-9dc3-4ac2d570765e",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "ca6b2bd5-3ddf-4167-a942-06e1955e49f8",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "ca-1_stmt.b.2": {
       "uuid": "e9474eb8-36d6-4eab-abeb-f9bd17e66b22",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "507b8b9d-2d40-4748-81c9-c5a13c8f8f05",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    },
    {
     "uuid": "c8e45d78-2afe-42ae-80e1-c1e2499a0346",
     "control-id": "cm-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "cm-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "cm-1_prm_2": {
       "value": "[specify frequency]"
      },
      "cm-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "cm-1_stmt.a": {
       "uuid": "52339583-19b6-4774-9213-50b9f42fe51f",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "2916ebd5-c45a-466e-b8e9-00dd15b0c94d",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "cm-1_stmt.b.1": {
       "uuid": "f9cc6f3f-c64f-4fae-9a32-f964ebdc8e74",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "678db1d2-a538-4986-ac94-63da312fe3f9",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "cm-1_stmt.b.2": {
       "uuid": "c548a71f-41d6-4e8c-b400-1764379348c4",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "a871cf91-04c7-4e03-9df6-80b3d5afc9bf",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    },
    {
     "uuid": "13af9343-73e7-4d71-b386-9a0844fa7e45",
     "control-id": "cp-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "cp-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "cp-1_prm_2": {
       "value": "[specify frequency]"
      },
      "cp-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "cp-1_stmt.a": {
       "uuid": "8bde1fa5-eb81-4a1b-9e6e-5827e176025a",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "157d7751-938c-441f-9299-02a339d98532",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "cp-1_stmt.b.1": {
       "uuid": "2fc9eec1-a49f-4cfa-9f7b-c702a1e21619",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "6358db78-bab1-4139-b512-f65d3e48248b",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "cp-1_stmt.b.2": {
       "uuid": "db5b3977-bd51-4505-b3e2-1597bbd4d930",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "3de33bbe-1a15-4d10-b35d-56fd85e24571",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    },
    {
     "uuid": "4050c933-3ecc-4a8d-8da7-391364685cbb",
     "control-id": "ia-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "ia-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "ia-1_prm_2": {
       "value": "[specify frequency]"
      },
      "ia-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "ia-1_stmt.a": {
       "uuid": "ba92e479-705f-47a4-a763-dfc098ba239d",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "5add335d-7375-49f0-843c-ac994e4d147b",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "ia-1_stmt.b.1": {
       "uuid": "dba8c469-5758-497e-9856-e472a2e08677",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "b04d86a0-b68c-41f0-9c0b-88a8daa457b7",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "ia-1_stmt.b.2": {
       "uuid": "b56e37b1-1f4c-479b-bfa1-a2773c2eebfd",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "c8fde380-9a41-404a-a88b-c20479a21618",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    },
    {
     "uuid": "229846dc-83cc-4ff2-a9ed-210490a343d9",
     "control-id": "ir-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "ir-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "ir-1_prm_2": {
       "value": "[specify frequency]"
      },
      "ir-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "ir-1_stmt.a": {
       "uuid": "7284efc2-d953-486c-ab8a-3caef6ce06c3",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "7b385445-5e7b-4656-98f1-0f1353aab59e",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "ir-1_stmt.b.1": {
       "uuid": "75c37e1a-6e8d-4ef0-99f4-c16f7995706c",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "e7ae4685-2e30-4e00-9ada-b00b5eaf5578",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "ir-1_stmt.b.2": {
       "uuid": "900591ec-2006-4622-bc87-59828d884d4f",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "f443c391-479d-492d-b7e9-55c9c2c107be",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    },
    {
     "uuid": "f0c6b63f-6b94-448f-bb16-db3d54b91734",
     "control-id": "ma-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "ma-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "ma-1_prm_2": {
       "value": "[specify frequency]"
      },
      "ma-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "ma-1_stmt.a": {
       "uuid": "d609e538-3976-418e-a368-58fc75cd03c0",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "93a9b046-63c4-4628-8547-39bc7d8df70c",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "ma-1_stmt.b.1": {
       "uuid": "df1a6dd8-9e18-4408-8783-cb30e0413f22",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "ad14f76a-a3eb-4349-8f6c-54cd99f1c040",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "ma-1_stmt.b.2": {
       "uuid": "f02f759d-7d4c-41f2-b153-f3cc1e157e39",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "32b337f6-eb61-4945-a139-4d2ae7737488",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    },
    {
     "uuid": "fa3a9747-3451-456a-aae9-9896e03a52c8",
     "control-id": "mp-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "mp-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "mp-1_prm_2": {
       "value": "[specify frequency]"
      },
      "mp-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "mp-1_stmt.a": {
       "uuid": "bab45ad3-65ee-43bc-9c3e-c3e4e2db8001",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "6668f521-4d5c-4317-868f-804878675bf2",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "mp-1_stmt.b.1": {
       "uuid": "ca35d4a5-ca73-4b3a-aa66-6c712c7a4a49",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "57e65240-5b41-40ee-89b1-f75d8fb259ad",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "mp-1_stmt.b.2": {
       "uuid": "0c5c6eda-9644-46f2-a29c-16fe4e248621",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "ea6c7fa7-ccbf-414c-8c6b-9c928e914b35",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    },
    {
     "uuid": "a85ff28e-517c-4455-8bd4-866103a2c94a",
     "control-id": "pe-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "pe-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "pe-1_prm_2": {
       "value": "[specify frequency]"
      },
      "pe-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "pe-1_stmt.a": {
       "uuid": "11fd3e46-4735-4986-91bc-747345fe608a",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "dceb4401-c1fd-41a7-9e07-8d82a8042e61",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "pe-1_stmt.b.1": {
       "uuid": "a37f91e2-190d-40f7-829c-39776c14c8b4",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "bbd2b372-b57d-4a3a-90c2-2189dd23664b",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "pe-1_stmt.b.2": {
       "uuid": "f3d57138-916c-4064-b2fc-aa8dd76849f8",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "f4a94538-220f-4f73-9487-73b72b68813e",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    },
    {
     "uuid": "97ba1f95-92a8-480b-a489-960661e4206b",
     "control-id": "pl-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "pl-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "pl-1_prm_2": {
       "value": "[specify frequency]"
      },
      "pl-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "pl-1_stmt.a": {
       "uuid": "ec7af577-ff22-46bf-ac0a-cf9d75c72ebb",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "679837fb-601e-4517-abe6-11ff6fc551b4",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "pl-1_stmt.b.1": {
       "uuid": "438f3e29-670a-49f2-8b9f-05d951318294",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "ddce2988-ce9b-4f15-a427-6f18e4ba1817",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "pl-1_stmt.b.2": {
       "uuid": "96a4d13c-bd2b-4038-96c5-0f923f404bbd",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "18d7c02e-f21b-4cd2-bf33-d27971ced47f",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    },
    {
     "uuid": "5e7498de-b540-4a28-b041-4381b023e98a",
     "control-id": "ps-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "ps-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "ps-1_prm_2": {
       "value": "[specify frequency]"
      },
      "ps-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "ps-1_stmt.a": {
       "uuid": "afe1703d-5e59-460b-b048-41b49699c5a1",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "7d6cafb2-b613-4807-ad61-4f0f649bd5ee",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "ps-1_stmt.b.1": {
       "uuid": "956c93e2-cf8f-482c-aaf7-91ab44c7cbd6",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "f4fbfbc2-1a94-456d-a713-9d547f18a0c7",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "ps-1_stmt.b.2": {
       "uuid": "6926c688-3fb2-4ab8-9acb-cff0b5acd365",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "2f9c701a-0f3e-4e3d-beae-debb08c406ed",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    },
    {
     "uuid": "789e6c0f-acda-4a94-9b48-7d41dd4c607c",
     "control-id": "ra-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "ra-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "ra-1_prm_2": {
       "value": "[specify frequency]"
      },
      "ra-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "ra-1_stmt.a": {
       "uuid": "8fe541ea-0920-42d0-8561-4e08f04d796c",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "5894d92b-05bf-4fc4-85dc-f5c37e112bc4",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "ra-1_stmt.b.1": {
       "uuid": "b0e9ed47-fe83-485d-8d79-979833543a83",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "c90ad6ee-5a40-4996-8e6c-d85ff3f7559e",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "ra-1_stmt.b.2": {
       "uuid": "d9a38f95-ded1-4d1d-afe2-242987222ebd",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "d6f6ac98-4f15-45f2-9ecc-4447e96af44f",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    },
    {
     "uuid": "55358f60-db9b-4d75-a313-5fa6c328273c",
     "control-id": "sa-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "sa-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "sa-1_prm_2": {
       "value": "[specify frequency]"
      },
      "sa-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "sa-1_stmt.a": {
       "uuid": "ae3f64be-2e62-4347-b06a-727bc28e4f9b",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "e5864f16-83f2-4faf-b7be-0810c6e58fc4",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "sa-1_stmt.b.1": {
       "uuid": "959519a9-3e12-47bc-8d76-50d9ab0b6544",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "bed8f51a-1773-493c-8167-c83712e03f01",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "sa-1_stmt.b.2": {
       "uuid": "9daa3848-9672-469c-9aa0-f363e3339123",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "518d4987-9436-4c1f-9e07-afa6b332f124",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    },
    {
     "uuid": "9e2852c6-f48a-47b2-9ea5-77cbbb42b365",
     "control-id": "sc-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "sc-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "sc-1_prm_2": {
       "value": "[specify frequency]"
      },
      "sc-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "sc-1_stmt.a": {
       "uuid": "5e2e8372-c13b-4cf5-90c5-e8833a9fe241",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "88cfadba-043b-483b-8032-73344aa53c96",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "sc-1_stmt.b.1": {
       "uuid": "8166980a-86c0-497d-87e4-453adfd0d4bd",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "9abaeb64-56d2-48a1-bd8d-7b55411d31ca",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "sc-1_stmt.b.2": {
       "uuid": "eeea34ff-18ab-4c35-bf32-c74dbf746e7b",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "ad20ff50-8a7c-4ffc-a918-260960f6fb42",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    },
    {
     "uuid": "81ba4fe8-1649-437b-9ecf-367fd87336e6",
     "control-id": "si-1",
     "properties": [
      {
       "name": "planned-completion-date",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "2020-11-27Z"
      }
     ],
     "annotations": [
      {
       "name": "implementation-status",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "planned",
       "remarks": "Describe the plan to complete the implementation."
      },
      {
       "name": "control-origination",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "sp-system"
      }
     ],
     "responsible-roles": {
      "program-director": {}
     },
     "parameter-settings": {
      "si-1_prm_1": {
       "value": "[replace with list of personnel or roles]"
      },
      "si-1_prm_2": {
       "value": "[specify frequency]"
      },
      "si-1_prm_3": {
       "value": "[specify frequency]"
      }
     },
     "statements": {
      "si-1_stmt.a": {
       "uuid": "915b10d2-2275-4d86-951a-eec23f9ee77a",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "682311e7-e3f7-4d94-acf9-131149887fda",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "si-1_stmt.b.1": {
       "uuid": "2a5a6f7f-aeea-4ea4-be1e-859df4bf7521",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "80ee0fe9-7f87-4dfa-887a-ac3bb2131943",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      },
      "si-1_stmt.b.2": {
       "uuid": "c152bbde-57fc-4864-ac51-861bd8bb83b4",
       "description": "Ignore.",
       "by-components": {
        "60f92bcf-f353-4236-9803-2a5d417555f4": {
         "uuid": "78e8f2bb-67d7-49d3-a993-ce4bedcfbc47",
         "description": "For the portion of the control satisfied by the service provider, describe\n                        **how** the control is met."
        }
       }
      }
     }
    }
   ]
  },
  "back-matter": {
   "resources": [
    {
     "uuid": "3a5ca2de-0f66-47e6-844d-6ccdf214b767",
     "title": "FedRAMP Applicable Laws and Regulations",
     "properties": [
      {
       "name": "conformity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "fedramp-citations"
      }
     ],
     "rlinks": [
      {
       "href": "https://www.fedramp.gov/assets/resources/templates/SSP-A12-FedRAMP-Laws-and-Regulations-Template.xlsx"
      }
     ]
    },
    {
     "uuid": "12da89ef-51dd-4404-948d-e9f0e25b961e",
     "title": "FedRAMP Master Acronym and Glossary",
     "properties": [
      {
       "name": "conformity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "fedramp-acronyms"
      }
     ],
     "rlinks": [
      {
       "href": "https://www.fedramp.gov/assets/resources/documents/FedRAMP_Master_Acronym_and_Glossary.pdf"
      }
     ]
    },
    {
     "uuid": "d45612a9-cf25-4ef6-b2dd-69e38ba2967a",
     "title": "[SAMPLE]Name or Title of Document",
     "properties": [
      {
       "name": "type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "law"
      },
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Publication Date"
      }
     ],
     "document-ids": [
      {
       "type": "doi",
       "identifier": "Identification Number"
      }
     ],
     "rlinks": [
      {
       "href": "https://domain.example/path/to/document.pdf"
      }
     ]
    },
    {
     "uuid": "a8a0cc81-800f-479f-93d3-8b8743d9b98d",
     "title": "[SAMPLE]Privacy-Related Law Citation",
     "properties": [
      {
       "name": "type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "law"
      },
      {
       "name": "type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "pii"
      },
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Publication Date"
      }
     ],
     "document-ids": [
      {
       "type": "doi",
       "identifier": "Identification Number"
      }
     ],
     "rlinks": [
      {
       "href": "https://domain.example/path/to/document.pdf"
      }
     ]
    },
    {
     "uuid": "545e75c3-537f-48fe-9630-95337916d982",
     "title": "[SAMPLE]Regulation Citation",
     "properties": [
      {
       "name": "type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "regulation"
      },
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Publication Date"
      }
     ],
     "document-ids": [
      {
       "type": "doi",
       "identifier": "Identification Number"
      }
     ],
     "rlinks": [
      {
       "href": "https://domain.example/path/to/document.pdf"
      }
     ]
    },
    {
     "uuid": "9d6cf2b4-8e88-4040-a33c-7bc206553a1a",
     "title": "[SAMPLE]Interconnection Security Agreement Title",
     "properties": [
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Date"
      },
      {
       "name": "version",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Version"
      }
     ]
    },
    {
     "uuid": "31a46c4f-2959-4287-bc1c-67297d7da60b",
     "desc": "CSP Logo",
     "properties": [
      {
       "name": "conformity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "prepared-for-logo"
      },
      {
       "name": "conformity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "csp-logo"
      }
     ],
     "rlinks": [
      {
       "href": "./logo.png",
       "media-type": "image/png"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ]
    },
    {
     "uuid": "c5866ad8-8ed7-49b4-844a-0276fa9f8f51",
     "desc": "Preparer Logo",
     "properties": [
      {
       "name": "conformity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "prepared-by-logo"
      }
     ],
     "rlinks": [
      {
       "href": "./party-1-logo.png",
       "media-type": "image/png"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ]
    },
    {
     "uuid": "0846b6ef-cfa4-4bb3-8280-717f7e7b04d4  ",
     "desc": "FedRAMP Logo",
     "properties": [
      {
       "name": "conformity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "fedramp-logo"
      }
     ],
     "rlinks": [
      {
       "href": "https://github.com/GSA/fedramp-automation/raw/master/assets/FedRAMP_LOGO.png"
      }
     ]
    },
    {
     "uuid": "2c1747d6-874a-49a2-8488-2fd9735416bf",
     "desc": "3PAO Logo",
     "properties": [
      {
       "name": "conformity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "3pao-logo"
      }
     ],
     "rlinks": [
      {
       "href": "./logo.png",
       "media-type": "image/png"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ]
    },
    {
     "uuid": "d2eb3c18-6754-4e3a-a933-03d289e3fad5",
     "desc": "The primary authorization boundary diagram.",
     "rlinks": [
      {
       "href": "./diagrams/boundary.png"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ],
     "remarks": "Section 9.2, Figure 9-1 Authorization Boundary Diagram (graphic)\\n\\nThis should be referenced in the\n               system-characteristics/authorization-boundary/diagram/link/@href flag using a value\n               of \\\"#d2eb3c18-6754-4e3a-a933-03d289e3fad5\\\""
    },
    {
     "uuid": "61081e81-850b-43c1-bf43-1ecbddcb9e7f",
     "desc": "The primary network diagram.",
     "rlinks": [
      {
       "href": "./diagrams/network.png"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ],
     "remarks": "Section 9.4, Figure 9-2 Network Diagram (graphic)\\n\\nThis should be referenced in the\n               system-characteristics/network-architecture/diagram/link/@href flag using a value\n               of \\\"#61081e81-850b-43c1-bf43-1ecbddcb9e7f\\\""
    },
    {
     "uuid": "ac5d7535-f3b8-45d3-bf3b-735c82c64547",
     "desc": "The primary data flow diagram.",
     "rlinks": [
      {
       "href": "./diagrams/dataflow.png"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ],
     "remarks": "Section 10, Figure 10-1 Data Flow Diagram (graphic)\\n\\nThis should be referenced in the\n               system-characteristics/data-flow/diagram/link/@href flag using a value\n               of \\\"#ac5d7535-f3b8-45d3-bf3b-735c82c64547\\\""
    },
    {
     "uuid": "090ab379-2089-4830-b9fd-26d0729e22e9",
     "title": "Policy Title",
     "desc": "Policy document",
     "properties": [
      {
       "name": "type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "policy"
      },
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Date"
      },
      {
       "name": "version",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Version"
      }
     ],
     "rlinks": [
      {
       "href": "./sample_policy.pdf"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ],
     "remarks": "Table 15-1 Attachments: Policy Attachment"
    },
    {
     "uuid": "ab300133-d749-4abb-b858-1cd6ffd8af9e",
     "title": "Policy Title",
     "desc": "Policy document",
     "properties": [
      {
       "name": "type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "policy"
      },
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Date"
      },
      {
       "name": "version",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Version"
      }
     ],
     "rlinks": [
      {
       "href": "./sample_policy.pdf"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ],
     "remarks": "Table 15-1 Attachments: Policy Attachment"
    },
    {
     "uuid": "1002a58e-9e11-4aa6-9ab4-2bde52995952",
     "title": "Procedure Title",
     "desc": "Procedure document",
     "properties": [
      {
       "name": "type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "procedure"
      },
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Date"
      },
      {
       "name": "version",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Version"
      }
     ],
     "rlinks": [
      {
       "href": "./sample_procedure.pdf"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ],
     "remarks": "Table 15-1 Attachments: Procedure Attachment"
    },
    {
     "uuid": "4bb1e2e5-261c-4b5c-b22c-e1627c2e8be6",
     "title": "Procedure Title",
     "desc": "Procedure document",
     "properties": [
      {
       "name": "type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "procedure"
      },
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Date"
      },
      {
       "name": "version",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Version"
      }
     ],
     "rlinks": [
      {
       "href": "./sample_procedure.pdf"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ],
     "remarks": "Table 15-1 Attachments: Procedure Attachment"
    },
    {
     "uuid": "90a128ac-c850-48f6-8fff-a55692f80b41",
     "title": "User's Guide",
     "desc": "User's Guide",
     "properties": [
      {
       "name": "conformity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "user-guide"
      },
      {
       "name": "type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "guide"
      },
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Date"
      },
      {
       "name": "version",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Version"
      }
     ],
     "rlinks": [
      {
       "href": "./sample_guide.pdf"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ],
     "remarks": "Table 15-1 Attachments: User's Guide Attachment"
    },
    {
     "uuid": "fab59751-b855-40cb-93c1-492562e20e18",
     "title": "Privacy Impact Assessment",
     "properties": [
      {
       "name": "conformity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "privacy-impact-assessment"
      },
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Date"
      },
      {
       "name": "version",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Version"
      }
     ],
     "rlinks": [
      {
       "href": "./pia.docx"
      }
     ],
     "attachments": [
      {
       "filename": "pia.docx",
       "value": "00000000"
      }
     ],
     "remarks": "Table 15-1 Attachments: Privacy Impact Assessment"
    },
    {
     "uuid": "489112e1-57f2-4c29-8dd0-95b1442fbf3b",
     "title": "Document Title",
     "desc": "Rules of Behavior",
     "properties": [
      {
       "name": "conformity",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "rules-of-behavior"
      },
      {
       "name": "type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "rob"
      },
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Date"
      },
      {
       "name": "version",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Version"
      }
     ],
     "rlinks": [
      {
       "href": "https://sample"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ],
     "remarks": "Table 15-1 Attachments: Rules of Behavior (ROB)"
    },
    {
     "uuid": "c7860916-f2f4-43aa-b578-d48cf8e6d381",
     "title": "Document Title",
     "desc": "Contingency Plan (CP)",
     "properties": [
      {
       "name": "type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "plan"
      },
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Date"
      },
      {
       "name": "version",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Version"
      }
     ],
     "rlinks": [
      {
       "href": "https://sample"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ],
     "remarks": "Table 15-1 Attachments: Contingency Plan (CP) Attachment"
    },
    {
     "uuid": "ab56cf27-0dae-40d6-89b7-d750137309af",
     "title": "Document Title",
     "desc": "Configuration Management (CM) Plan",
     "properties": [
      {
       "name": "type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "plan"
      },
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Date"
      },
      {
       "name": "version",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Version"
      }
     ],
     "rlinks": [
      {
       "href": "https://sample"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ],
     "remarks": "Table 15-1 Attachments: Configuration Management (CM) Plan Attachment"
    },
    {
     "uuid": "3f771ab5-8016-4571-98d1-f0fb962e15e2",
     "title": "Document Title",
     "desc": "Incident Response (IR) Plan",
     "properties": [
      {
       "name": "type",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "plan"
      },
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Date"
      },
      {
       "name": "version",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Version"
      }
     ],
     "rlinks": [
      {
       "href": "https://sample"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ],
     "remarks": "Table 15-1 Attachments: Incident Response (IR) Plan Attachment"
    },
    {
     "uuid": "49fb4631-1da2-41ca-b0b3-e1b1006d4025",
     "title": "Separation of Duties Matrix",
     "desc": "Separation of Duties Matrix",
     "properties": [
      {
       "name": "publication",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Date"
      },
      {
       "name": "version",
       "ns": "https://fedramp.gov/ns/oscal",
       "value": "Document Version"
      }
     ],
     "rlinks": [
      {
       "href": "https://sample"
      }
     ],
     "attachments": [
      {
       "value": "00000000"
      }
     ],
     "remarks": "Table 15-1 Attachments: Separation of Duties Matrix Attachment"
    },
    {
     "uuid": "9f1aae37-7359-411f-86c1-768aaab85e63",
     "title": "FedRAMP High Baseline",
     "rlinks": [
      {
       "href": "https://raw.githubusercontent.com/usnistgov/OSCAL/v1.0.0-milestone3/content/fedramp.gov/xml/FedRAMP_HIGH-baseline_profile.xml",
       "media-type": "application/xml"
      }
     ],
     "remarks": "Pointer to High baseline content in OSCAL."
    },
    {
     "uuid": "890170c3-d4fa-4d25-ab96-8e4bf7cc237c",
     "title": "FedRAMP Moderate Baseline",
     "rlinks": [
      {
       "href": "https://raw.githubusercontent.com/usnistgov/OSCAL/v1.0.0-milestone3/content/fedramp.gov/xml/FedRAMP_MODERATE-baseline_profile.xml",
       "media-type": "application/xml"
      }
     ],
     "remarks": "Pointer to Moderate baseline content in OSCAL."
    },
    {
     "uuid": "2acaf846-5496-4d36-8565-9a15b48aef2c",
     "title": "FedRAMP Low Baseline",
     "rlinks": [
      {
       "href": "https://raw.githubusercontent.com/usnistgov/OSCAL/v1.0.0-milestone3/content/fedramp.gov/xml/FedRAMP_LOW-baseline_profile.xml",
       "media-type": "application/xml"
      }
     ],
     "remarks": "Pointer to Low baseline content in OSCAL."
    }
   ]
  }
 }
}